<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Font Awesome Free, creates a package, and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.FontAwesomeFree</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>fonts/fonticons</string>
		<key>NAME</key>
		<string>FontAwesomeFree</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-fonticons-FontAwesomeFree</string>
			</array>
			<key>category</key>
			<string>Fonts</string>
			<key>description</key>
			<string>Get vector icons and social logos on your website with Font Awesome, the web's most popular icon set and toolkit.</string>
			<key>developer</key>
			<string>Fonticons</string>
			<key>display_name</key>
			<string>Font Awesome Free</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.FontAwesomeFree</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
