<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest RealVNC Viewer disk image.

This recipe is known to redownload every time it's run.  Ask RealVNC to put their download somewhere AutoPkg can figure out whether it's necessary.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.RealVNCViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RealVNCViewer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.realvnc.com/download/viewer/macosx/</string>
				<key>re_pattern</key>
				<string>download\/viewer\/macosx\/file\/" method="post"\n.*data-ga-label="viewer ([\d.]*)</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.realvnc.com/download/file/viewer.files/VNC-Viewer-%version%-MacOSX-x86_64.dmg</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VNC Viewer.app</string>
				<key>requirement</key>
				<string>identifier "com.realvnc.vncviewer" and anchor apple generic</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
