<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest RealVNC Viewer disk image.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.RealVNCViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RealVNCViewer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;button id="download" type="submit"&gt;Download VNC Viewer ([\d\.]+)&lt;\/button&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://www.realvnc.com/download/viewer/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://www.realvnc.com/download/file/viewer.files/VNC-Viewer-%version%-MacOSX-x86_64.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VNC Viewer.app</string>
				<key>requirement</key>
				<string>identifier "com.realvnc.vncviewer" and anchor apple generic</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
