<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest RealVNC Viewer disk image.

This recipe is known to redownload every time it's run.  Ask RealVNC to put their download somewhere AutoPkg can figure out whether it's necessary.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.RealVNCViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RealVNCViewer</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.realvnc.com/download/binary/1797/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>referer</key>
					<string>https://www.realvnc.com/download/get/1797/</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VNC Viewer.app</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: RealVNC Limited</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
