<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest RealVNC Viewer and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.RealVNCViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RealVNCViewer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/realvnc</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-realvnc-RealVNCViewer</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>VNC enables you to remotely access and control your devices wherever you are in the world, whenever you need to.</string>
			<key>developer</key>
			<string>RealVNC</string>
			<key>display_name</key>
			<string>RealVNC Viewer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.RealVNCViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/VNC Viewer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
