<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages ATTO Config Tool.

Note: This recipe requires installing BOTH AutoPkg AND the ConfigTool itself--the latter BY HAND.  IDEALLY this would occur in a clean virtual machine, and is not intended to occur on an AutoPkg "server".  Thank Flexera InstallAnywhere and a cross-platform Java-based application for this incredibly strange recipe.

I'm skipping a few things I normally do for my AutoPkg recipes:
- CodeSignatureVerifier: Presumably this software has been manually sourced from a trusted location and then manually installed
- A .munki Recipe: Since the retrieval of the ConfigTool installer is manual, the installation is manual, and running this recipe on a clean VM is manual, there doesn't seem to make much sense to automate the import of the resulting package into Munki</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ATTOConfigTool</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>/Applications/ATTO ConfigTool/ATTO ConfigTool.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Library</key>
					<string>0755</string>
					<key>Library/LaunchAgents</key>
					<string>0755</string>
					<key>Library/LaunchDaemons</key>
					<string>0755</string>
					<key>private</key>
					<string>0755</string>
					<key>private/etc</key>
					<string>0755</string>
					<key>private/var</key>
					<string>0755</string>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/libexec</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/ATTO ConfigTool</string>
				<key>source_path</key>
				<string>/Applications/ATTO ConfigTool</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/ATTO ConfigTool/Logs/ATTO_ConfigTool_v*Install*log</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%found_filename%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/LaunchAgents/com.attotech.attonfcd.plist</string>
				<key>source_path</key>
				<string>/Library/LaunchAgents/com.attotech.attonfcd.plist</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/LaunchDaemons/com.attotech.attocfgd.plist</string>
				<key>source_path</key>
				<string>/Library/LaunchDaemons/com.attotech.attocfgd.plist</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/private/etc/attotech</string>
				<key>source_path</key>
				<string>/private/etc/attotech</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/private/var/attotech</string>
				<key>source_path</key>
				<string>/private/var/attotech</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/private/var/attotech/log/attocfgd.log</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot/private/var/attotech/log/attocfgd_snmp.log</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/usr/local/libexec/attocfgd</string>
				<key>source_path</key>
				<string>/usr/local/libexec/attocfgd</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>template_path</key>
				<string>%RECIPE_DIR%/PackageInfoTemplate</string>
			</dict>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>private</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.attotech.ATTOConfigTool.pkg</string>
					<key>infofile</key>
					<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
					<key>pkgname</key>
					<string>ATTOConfigTool-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
