<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Teradici client beta disk image, builds an installation package, and imports it into Munki.

NOTES:

- Teradici's client beta has no version information, thus the requirement for a package to have some semblance of versioning
- The USB redirection is based on a kext that uses Team ID RU4LW7W32C--this will need to be approved either manually or via a MDM
- This recipe depends on homebysix's FindAndReplace.  Add homebysix's repo via:

autopkg repo-add homebysix-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.teradiciclientbeta</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/teradici</string>
		<key>NAME</key>
		<string>TeradiciClientBeta</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>PCoIPClient</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-teradici-TeradiciClientBeta</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Securely deliver high-performance desktops to knowledge workers and power users requiring even the most graphics-intensive applications.</string>
			<key>developer</key>
			<string>Teradici</string>
			<key>display_name</key>
			<string>Teradici Client Beta</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.teradiciclientbeta</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
