<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Teradici client beta disk image.

NOTES:
- DOWNLOAD_URL and _must_ be overridden in order for this recipe to work.

Log into your organization's Teradici account, visit the download URL for the Teradici (Mac) client beta, and paste in the URL referenced under "Download using a script" in the "To download the latest beta version" command:

Example:
https://dl.teradici.com/XXXXXXXXXXXXXXXX/pcoip-client-beta/raw/names/pcoip-client-dmg/versions/latest/pcoip-client_latest.dmg

- This recipe depends on homebysix's FindAndReplace.  Add homebysix's repo via:

autopkg repo-add homebysix-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.teradiciclientbeta</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>OVERRIDE_ME_PLEASE</string>
		<key>NAME</key>
		<string>TeradiciClientBeta</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>DOWNLOAD_URL == "OVERRIDE_ME_PLEASE"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--head</string>
				</array>
				<key>re_pattern</key>
				<string>filename="pcoip-client_(.+).dmg"</string>
				<key>result_output_var_name</key>
				<string>found_version</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>-</string>
				<key>input_string</key>
				<string>%found_version%</string>
				<key>replace</key>
				<string>.</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/PCoIPClient.app</string>
				<key>requirement</key>
				<string>identifier "com.teradici.swiftclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = RU4LW7W32C</string>
				<key>version</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
