<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Originally created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)

NOTES:
- DOWNLOAD_URL and _must_ be overridden in order for this recipe to work.

Log into your organization's Teradici account, visit the download URL for the Teradici (Mac) agent, and paste in the URL referenced under "Download using a script" in the "To download the latest stable version" command:

Example:
https://dl.teradici.com/XXXXXXXXXXXXXXXX/pcoip-agent/raw/names/pcoip-agent-graphics-pkg/versions/latest/pcoip-agent-graphics_latest.pkg</string>
	<key>Description</key>
	<string>Downloads the latest version of Teradici CAS PCoIP Graphics Agent.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.TeradiciCASGraphicsAgent</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>OVERRIDE_ME_PLEASE</string>
		<key>NAME</key>
		<string>TeradiciCASGraphicsAgent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>DOWNLOAD_URL == "OVERRIDE_ME_PLEASE"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Teradici Corporation (RU4LW7W32C)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
