<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages InCopy Smart Connection for installation for InCopy CC 2015 and imports it into Munki

NOTES:
- This recipe depends on hjuutilainen's ChecksumVerifier.  Add this repos via:

autopkg repo-add hjuutilainen-recipes

- Specific pkgs are disabled via InstallerChoices depending on the product that's being installed.  Due to this, the packages are identical--thus force_munkiimport is set to true
- This recipe does not download the Smart Connection disk image--feed the disk image into the recipe via the following format:

autopkg run WoodwingSmartConnectionInCopyCC2015.munki -p /path/to/Smart_Connection_for_Adobe_CC_2015_v11.2.0_Build42.dmg</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.WoodwingSmartConnectionInCopyCC2015</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/woodwing</string>
		<key>NAME</key>
		<string>WoodwingSmartConnectionInCopyCC2015</string>
		<key>pkginfo</key>
		<dict>
			<key>Comment</key>
			<string>Choices are choice3 (Smart Connection Plug-Ins for Adobe InCopy CC 2015 parent), choice4 (Smart Connection Plug-Ins for Adobe InCopy CC 2015), and choice5 (Overset Plug-In for InCopy for Adobe InCopy CC 2015)</string>
			<key>blocking_applications</key>
			<array>
				<string>Adobe InCopy CC 2015</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-woodwing-WoodwingSmartConnectionInCopyCC2015</string>
			</array>
			<key>category</key>
			<string>Plugins</string>
			<key>description</key>
			<string>Smart Connection plugins for InCopy CC 2015.</string>
			<key>developer</key>
			<string>Woodwing</string>
			<key>display_name</key>
			<string>Smart Connection InCopy CC 2015</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice3</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice4</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice5</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InCopyCC2015</string>
			</array>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.WoodwingSmartConnectionCC2015</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%PKG%/Smart_Connection_for_Adobe_CC_2015_*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Unpack the original package</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/uninstaller.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Extract the package payload of uninstaller.pkg</string>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/checksum</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/Uninstaller/Uninstall Smart Connection for Adobe CC 2015 v*.app/Contents/MacOS/Uninstall Smart Connection for Adobe CC 2015 v*</string>
			</dict>
			<key>Comment</key>
			<string>Copy out the first uninstall script, working around lack of globs in ChecksumVerifier</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>e6a61acf275e0e5c4b77480be1517b57</string>
				<key>checksum_pathname</key>
				<string>%RECIPE_CACHE_DIR%/checksum</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches 11.2.0, build 42 on the uninstall script</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/checksum.sh</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/Uninstaller/Uninstall Smart Connection for Adobe CC 2015 v*.app/Contents/Resources/Uninstall Smart Connection for Adobe CC 2015 v*.sh</string>
			</dict>
			<key>Comment</key>
			<string>Copy out the second uninstall script, working around lack of globs in ChecksumVerifier</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>e6a61acf275e0e5c4b77480be1517b57</string>
				<key>checksum_pathname</key>
				<string>%RECIPE_CACHE_DIR%/checksum.sh</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches 11.2.0, build 42 on the second uninstall.sh script</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2015/Plug-Ins/Woodwing</string>
			</dict>
			<key>Comment</key>
			<string>Create a root for the expanded scenterprise.pkg payload</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2015/Plug-Ins/Woodwing</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/scenterprise.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Extract the package payload of scenterprise.pkg</string>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Adobe InCopy CC 2015/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Create an installs array item for SCEnterprise.InDesignPlugin</string>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge the installs array into the pkginfo</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"CFBundleShortVersionString" = "v([\d\.]+)</string>
				<key>result_output_var_name</key>
				<string>discovered_version</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2015/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin/Versions/A/Resources/Resources/English.lproj/InfoPlist.strings</string>
			</dict>
			<key>Comment</key>
			<string>Extract the version number</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"CFBundleShortVersionString" = .* build (\d+)</string>
				<key>result_output_var_name</key>
				<string>build</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2015/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin/Versions/A/Resources/Resources/English.lproj/InfoPlist.strings</string>
			</dict>
			<key>Comment</key>
			<string>Extract the build number</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%discovered_version%.%build%</string>
				</dict>
			</dict>
			<key>Comment</key>
			<string>Add Munki pkginfo, set "version" to version plus build as the Munki</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%RECIPE_DIR%/Reference Scripts CC 2015/Fixed Scripts/wwuninstall_incopycc2015_fixed.sh</string>
					<string>--postuninstall_script=%RECIPE_DIR%/Reference Scripts CC 2015/My Scripts/Forget InCopy Receipts CC2015.sh</string>
				</array>
				<key>force_munkiimport</key>
				<true/>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/SmartConnectionCC2015.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Comment</key>
			<string>Import the package into Munki</string>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
