<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages InCopy Smart Connection for installation for InCopy CC 2014 and imports it into Munki

NOTE: This recipe depends on keeleysam's MunkiPkginfoReceiptsEditor and hjuutilainen's ChecksumVerifier.  Add these repos via:

autopkg repo-add keeleysam-recipes
autopkg repo-add hjuutilainen-recipes

Also, specific pkgs are disabled via InstallerChoices depending on the product that's being installed.  Due to this, the packages are identical--thus force_munkiimport is set to true.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.WoodwingSmartConnectionInCopyCC2014</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/woodwing</string>
		<key>NAME</key>
		<string>WoodwingSmartConnectionInCopyCC2014</string>
		<key>pkginfo</key>
		<dict>
			<key>Comment</key>
			<string>Choices are choice3 (Smart Connection Plug-Ins for Adobe InCopy CC 2014 parent), choice4 (Smart Connection Plug-Ins for Adobe InCopy CC 2014), and choice5 (Overset Plug-In for InCopy for Adobe InCopy CC 2014)

Requirement for ExtensionManagerCC is for Sticky Notes plugin install</string>
			<key>blocking_applications</key>
			<array>
				<string>Adobe InCopy CC 2014</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-woodwing-WoodwingSmartConnectionInCopyCC2014</string>
			</array>
			<key>category</key>
			<string>Plugins</string>
			<key>description</key>
			<string>Smart Connection plugins for InCopy CC 2014.</string>
			<key>developer</key>
			<string>Woodwing</string>
			<key>display_name</key>
			<string>Smart Connection InCopy CC 2014</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice3</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice4</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice5</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InCopyCC2014</string>
				<string>ExtensionManagerCC</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.WoodwingSmartConnectionCC2014</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%PKG%/Smart_Connection_for_Adobe_CC_2014_*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Unpack the original package</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/uninstaller.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Extract the package payload of uninstaller.pkg</string>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/checksum</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/Uninstaller/Uninstall Smart Connection for Adobe CC 2014 v*.app/Contents/MacOS/Uninstall Smart Connection for Adobe CC 2014 v*</string>
			</dict>
			<key>Comment</key>
			<string>Copy out the first uninstall script, working around lack of globs in ChecksumVerifier</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>84a03bad8a17deedde3e01a2661c098b</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/checksum</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches 10.2.1, build 75 on the uninstall script</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/checksum.sh</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_uninstaller/Uninstaller/Uninstall Smart Connection for Adobe CC 2014 v*.app/Contents/Resources/Uninstall Smart Connection for Adobe CC 2014 v*.sh</string>
			</dict>
			<key>Comment</key>
			<string>Copy out the second uninstall script, working around lack of globs in ChecksumVerifier</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>84a03bad8a17deedde3e01a2661c098b</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/checksum.sh</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches 10.2.1, build 75 on the second uninstall.sh script</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>com\.WoodWing\.(smartConnectionForAdobeCc\d+V\d+)\.SCEnterprise\.pkg"</string>
				<key>result_output_var_name</key>
				<string>receipt_string</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/unpack/scenterprise.pkg/PackageInfo</string>
			</dict>
			<key>Comment</key>
			<string>Extract the package receipt string</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2014/Plug-Ins/Woodwing</string>
			</dict>
			<key>Comment</key>
			<string>Create a root for the expanded scenterprise.pkg payload</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2014/Plug-Ins/Woodwing</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/scenterprise.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Extract the package payload of scenterprise.pkg</string>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload_scenterprise/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Adobe InCopy CC 2014/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Create an installs array item for SCEnterprise.InDesignPlugin</string>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge the installs array into the pkginfo</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"CFBundleShortVersionString" = "v([\d\.]+)</string>
				<key>result_output_var_name</key>
				<string>discovered_version</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2014/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin/Versions/A/Resources/Resources/English.lproj/InfoPlist.strings</string>
			</dict>
			<key>Comment</key>
			<string>Extract the version number</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"CFBundleShortVersionString" = .* build (\d+)</string>
				<key>result_output_var_name</key>
				<string>build</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/payload_scenterprise/root/Applications/Adobe InCopy CC 2014/Plug-Ins/Woodwing/SCEnterprise.InDesignPlugin/Versions/A/Resources/Resources/English.lproj/InfoPlist.strings</string>
			</dict>
			<key>Comment</key>
			<string>Extract the build number</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%discovered_version%.%build%</string>
				</dict>
			</dict>
			<key>Comment</key>
			<string>Add Munki pkginfo, set "version" to version plus build as the Munki</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%RECIPE_DIR%/Reference Scripts CC 2014/Fixed Scripts/wwuninstall_incopycc2014_fixed.sh</string>
					<string>--postuninstall_script=%RECIPE_DIR%/Reference Scripts CC 2014/My Scripts/Forget InCopy Receipts.sh</string>
				</array>
				<key>force_munkiimport</key>
				<true/>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/SmartConnectionCC2014.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Comment</key>
			<string>Import the package into Munki</string>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_ids_set_optional_true</key>
				<array>
					<string>com.WoodWing.%receipt_string%.ElementLabel.pkg</string>
					<string>com.WoodWing.%receipt_string%.ElementLabelUI.pkg</string>
					<string>com.WoodWing.%receipt_string%.InDesign.pkg</string>
					<string>com.WoodWing.%receipt_string%.InDesignDM.pkg</string>
					<string>com.WoodWing.%receipt_string%.InDesignServer.pkg</string>
					<string>com.WoodWing.%receipt_string%.InDesignServerDM.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCCoreInDesign.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMActiveElement.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMAudio.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMDossierLink.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMHotspot.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMScrollableArea.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMSlideShow.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMVideo.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCEntDMWidget.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCProElementsPanel.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCProFramesInDesign.pkg</string>
					<string>com.WoodWing.%receipt_string%.SCProInDesignUI.pkg</string>
					<string>com.WoodWing.%receipt_string%.SmartConnectionBookSupport.pkg</string>
					<string>com.WoodWing.%receipt_string%.SmartDPSTools.pkg</string>
					<string>com.WoodWing.%receipt_string%.SmartDPSToolsUI.pkg</string>
					<string>com.WoodWing.%receipt_string%.SmartJumpInDesignUI.pkg</string>
					<string>com.WoodWing.%receipt_string%.WoodWingUI.pkg</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Mark receipts optional for items not installed due to installerchoices</string>
			<key>Processor</key>
			<string>com.github.keeleysam.recipes.GoogleTalkPlugin/MunkiPkginfoReceiptsEditor</string>
		</dict>
	</array>
</dict>
</plist>
