<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage the Wipster Review Panel and import it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.WipsterReviewPanel</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/wipster</string>
		<key>NAME</key>
		<string>WipsterReviewPanel</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe After Effects CC 2018</string>
				<string>Adobe Premiere Pro CC 2018</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-wipster-WipsterReviewPanel</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Your video workflow, reimagined.</string>
			<key>developer</key>
			<string>Wipster</string>
			<key>display_name</key>
			<string>Wipster Review Panel</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.WipsterReviewPanel</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>