<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Blurb InDesign plugin package, repackages it, and imports it into Munki.

NOTES:
- THIS PLUGIN WILL CAUSE INDESIGN TO CRASH UNLESS THE BLURB DATA FOLDER IS AVAILABLE IN THE USER'S HOME.  There is a recipe alongside this one to install the Blurb Data folder
- An override to this recipe makes the most sense when it is version specific, e.g. "autopkg make-override Blurb.pkg -n BlurbCC2018.munki"
- INDESIGN_APP_VERSION must be overridden with a string that matches the targeted version of InDesign.  Current (as of 2020-4-20) supported version strings are:

2020
CC
CC 2014
CC 2015
CC 2017
CC 2018
CC 2019
CS3
CS4
CS5
CS5.5
CS6

- "blocking_applications" and "requires" should reflect the targeted version of InDesign
- NAME should be edited to reflect the version of InDesign being targeted, e.g. "BlurbCC2018"
- PACKAGE_ID must be overridden with a version-specific package ID, e.g. "com.blurb.BlurbCC2018.pkg"
- PACKAGE_NAME must be overridden with a version-specific package name, e.g. "BlurbCC2018"</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.Blurb</string>
	<key>Input</key>
	<dict>
		<key>INDESIGN_APP_VERSION</key>
		<string>app_version</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/blurb</string>
		<key>NAME</key>
		<string>BlurbVERSION</string>
		<key>PACKAGE_ID</key>
		<string>com.blurb.BlurbVERSION.pkg</string>
		<key>PACKAGE_NAME</key>
		<string>BlurbVERSION</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>InDesign</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-blurb-BlurbVERSION</string>
			</array>
			<key>category</key>
			<string>Plugin</string>
			<key>description</key>
			<string>Unleash your creativity and design something magical with the Blurb Adobe InDesign plug-in.</string>
			<key>developer</key>
			<string>Blurb</string>
			<key>display_name</key>
			<string>Blurb</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InDesign</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.Blurb</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>NAME == "BlurbVERSION"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
