<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Blurb InDesign plugin package, builds a package to install the "Blurb Data" in the user's home, and imports it into Munki.

NOTES:
- This recipe depends on Joe Chilcote's outset, located here:
https://github.com/chilcote/outset

- The update_for variable should reflect all the different versions of Blurb in use</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.BlurbData</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/blurb</string>
		<key>NAME</key>
		<string>BlurbData</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireLogout</string>
			<key>catalogs</key>
			<array>
				<string>development-blurb-BlurbData</string>
			</array>
			<key>category</key>
			<string>Plugin</string>
			<key>description</key>
			<string>Support files for the Blurb InDesign plugin.</string>
			<key>developer</key>
			<string>Blurb</string>
			<key>display_name</key>
			<string>Blurb Data</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>outset</string>
			</array>
			<key>update_for</key>
			<array>
				<string>BlurbVERSION</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.BlurbData</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
