<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads CatDV Pro and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.CatDVPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CatDVPro</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/squareboxsystems</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>CatDV Pro</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-squareboxsystems-CatDVPro</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>CatDV helps companies find and reuse their media assets, helps teams to collaborate and to get more done, saving both time and money.</string>
			<key>developer</key>
			<string>Square Box Systems</string>
			<key>display_name</key>
			<string>CatDV Pro</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.CatDVPro</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
