<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest CatDV Pro.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.CatDVPro</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>14</string>
		<key>NAME</key>
		<string>CatDVPro%MAJOR_VERSION%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https:\/\/www\.squarebox\.com\/download\/CatDVPro[\d\.]+\.dmg</string>
				<key>result_output_var_name</key>
				<string>download_url</string>
				<key>url</key>
				<string>http://www.squarebox.com/support/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>CatDVPro.dmg</string>
				<key>url</key>
				<string>%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CatDV Pro */CatDV Pro.app</string>
				<key>requirement</key>
				<string>identifier "uk.co.squarebox.CatDVPro" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P3F2RJCPNA</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
