<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest CatDV Pro.

Override MAJOR_VERSION for versions of CatDV Pro besides version 11.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.CatDVPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CatDVPro</string>
		<key>MAJOR_VERSION</key>
		<string>11</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.squarebox.com/download-links/</string>
				<key>re_pattern</key>
				<string>"(http://.*CatDVPro%MAJOR_VERSION%.*dmg)"</string>
				<key>result_output_var_name</key>
				<string>download_url</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%download_url%</string>
				<key>filename</key>
				<string>%NAME%-%MAJOR_VERSION%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CatDV Pro */CatDV Pro.app</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Square Box Systems Ltd</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
