<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Kindle Textbook Creator package and imports it into Munki.

Note that since all the packages from Amazon have version "0", this recipe will not cause updated packages to be imported into Munki if there is a previous version available in the repo.  You can tell the package to be forcibly imported via "autopkg run -k force_munkiimport=true KindleTextbookCreator.munki".</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.KindleTextbookCreator</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/amazon</string>
		<key>NAME</key>
		<string>KindleTextbookCreator</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Kindle Textbook Creator</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-amazon-KindleTextbookCreator</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Kindle Textbook Creator is a free tool for authors and educators that makes it fast and easy to convert PDFs of textbooks, course notes, study guides and other educational material into Kindle books.</string>
			<key>developer</key>
			<string>Amazon</string>
			<key>display_name</key>
			<string>Kindle Textbook Creator</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.KindleTextbookCreator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Kindle Textbook Creator v([\.0-9]+) </string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://www.amazon.com/gp/feature.html?docId=1002998671</string>
				<key>curl_opts</key>
				<array>
					<string>--compress</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/KITCAppComponent.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Kindle Textbook Creator.app/Contents/MacOS/Kindle Textbook Creator</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
