<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Kindle Textbook Creator package and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.KindleTextbookCreator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KindleTextbookCreator</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/amazon</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Kindle Textbook Creator</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-amazon-KindleTextbookCreator</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Kindle Textbook Creator is a free tool for authors and educators that makes it fast and easy to convert PDFs of textbooks, course notes, study guides and other educational material into Kindle books.</string>
			<key>developer</key>
			<string>Amazon</string>
			<key>display_name</key>
			<string>Kindle Textbook Creator</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.KindleTextbookCreator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.amazon.com/gp/feature.html?docId=1002998671</string>
				<key>re_pattern</key>
				<string>Kindle Textbook Creator v([\.0-9]+) </string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
