<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Kindle Previewer disk image and imports it into Munki.

NOTE: The Kindle Previewer postinstall script (at least as of 2.941) is the following:
####
#!/bin/sh

sudo chmod -R 755 /Applications/Kindle\ Previewer.app
sudo chown -R $USER /Applications/Kindle\ Previewer.app
####

And Kindle Previewer, when running, writes files and directories under:
/Applications/Kindle Previewer.app/Contents/MacOS

You will need to address this issue before Kindle Previewer will work correctly.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.kindlepreviewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KindlePreviewer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/amazon</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Kindle Previewer</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-amazon-KindlePreviewer</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Kindle Previewer is a graphical user interface tool that emulates how books display across Kindle devices and apps.</string>
			<key>developer</key>
			<string>Amazon</string>
			<key>display_name</key>
			<string>Kindle Previewer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.kindlepreviewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
