<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Send to Kindle disk image and imports it into Munki.

Requiring a restart rather than troubleshooting the Send to Kindle LaunchAgent trying to find a keychain to store "DeviceSerialNumber".</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.SendToKindle</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/amazon</string>
		<key>NAME</key>
		<string>SendToKindle</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireRestart</string>
			<key>blocking_applications</key>
			<array>
				<string>Send to Kindle</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-amazon-SendToKindle</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Reading your personal documents on a Kindle has never been easier.</string>
			<key>developer</key>
			<string>Amazon</string>
			<key>display_name</key>
			<string>Send to Kindle</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.SendToKindle</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
