<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SlingTV and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.SlingTV</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/dishnetwork</string>
		<key>NAME</key>
		<string>SlingTV</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-dishnetwork-SlingTV</string>
			</array>
			<key>description</key>
			<string>It's watching your favorite soccer team the moment it airs. It’s the latest episodes of your favorite Novela and hot new movies on-demand. It’s Sling and it's time to TAKE BACK TV.</string>
			<key>developer</key>
			<string>Dish Network</string>
			<key>display_name</key>
			<string>SlingTV</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.SlingTV</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
