<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Tableau Desktop disk image, which contains the Tableau FLEXNet pkg. This assumes the FLEXNet pkg isn't updated any more frequently than Tableau Desktop itself.

NOTE: As of 2/27/2016 (the 9.2.5 release of Tableau's software) the TableauFLEXNet package has been updated with a new code signature but did not receive a new version.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.tableau-desktop-FLEXNet</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://www.tableau.com/downloads/desktop/mac</string>
		<key>NAME</key>
		<string>TableauDesktopFLEXNet</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>3rd Party Mac Developer Installer: Tableau Software, Inc. (QJ4XPRK37C)</string>
					<string>Apple Worldwide Developer Relations Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/Tableau.app/Contents/Installers/Tableau FLEXNet.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
