<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Affinity Publisher disk image.

NOTES:
- This is NOT the Mac App Store (MAS) version of Affinity Publisher
- This recipe depends on homebysix's FindAndReplace.  Add homebysix's repo via:

autopkg repo-add homebysix-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.affinitypublisher</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AffinityPublisher</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(https:\/\/[\da-z]+\.cloudfront\.net\/macos\/publisher\/[\d\.]+\/affinity-publisher-[\d\.]+\.dmg\?Expires=[\d]+&amp;amp;Signature=.*__&amp;amp;Key-Pair-Id=[\dA-Z]+)"</string>
				<key>result_output_var_name</key>
				<string>encoded_download_url</string>
				<key>url</key>
				<string>https://store.serif.com/en-us/update/macos/publisher/1/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>&amp;amp;</string>
				<key>input_string</key>
				<string>%encoded_download_url%</string>
				<key>replace</key>
				<string>&amp;</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>AffinityPublisher.dmg</string>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Affinity Publisher.app</string>
				<key>requirement</key>
				<string>identifier "com.seriflabs.affinitypublisher" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6LVTQB9699")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
