<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage the MediaBank 5 plugin for InDesign CC 2020.  This recipe does not download the MediaBank 5 tar.gz archive--feed the tar.gz archive into the recipe via the following format:

autopkg run MediaBank5InDesignCC2020.pkg -p /path/to/MediaBank_Installer_osx_2020_20201009.tar.gz</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.MediaBank5InDesignCC2020</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MediaBank5InDesignCC2020</string>
		<key>PACKAGE_ID</key>
		<string>com.wavecorp.MediaBank5InDesignCC2020.pkg</string>
		<key>PLUGIN_INSTALL_DIR</key>
		<string>Applications/Adobe InDesign 2020/Plug-Ins</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.MediaBank5CC2020</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%PKG%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/PluginInstaller.app/Contents/app/Contents/Resources/MediaBank.zxp</string>
				<key>archive_format</key>
				<string>zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/MediaBank5zxp_unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\t version="([\d\.]+)"</string>
				<key>result_output_var_name</key>
				<string>major_version</string>
				<key>url</key>
				<string>file:///%RECIPE_CACHE_DIR%/MediaBank5zxp_unarchive/MediaBank.mxi</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Build Date - (\d+)&lt;br&gt;</string>
				<key>result_output_var_name</key>
				<string>build_date</string>
				<key>url</key>
				<string>file:///%RECIPE_CACHE_DIR%/MediaBank5zxp_unarchive/MediaBank.mxi</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/MediaBank5zxp_unarchive/mac/2020/ContentManager.sdk.InDesignPlugin</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/%PLUGIN_INSTALL_DIR%/ContentManager.sdk.InDesignPlugin</string>
				<key>overwrite</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/MediaBank5zxp_unarchive/mac/2020/ContentManagerUI.sdk.InDesignPlugin</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/%PLUGIN_INSTALL_DIR%/ContentManagerUI.sdk.InDesignPlugin</string>
				<key>overwrite</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>755</string>
							<key>path</key>
							<string>%PLUGIN_INSTALL_DIR%</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%PACKAGE_ID%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%major_version%.%build_date%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
