<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage the MediaBank Gold Creative Cloud Extension.  This recipe does not download the MediaBank Gold tar archive--feed the tar archive into the recipe via the following format:

autopkg run MediaBankGoldCreativeCloudExtension.pkg -p /path/to/MediaBankGold_Installer_osx_CC_2018_20190127.tar</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.MediaBankGoldCreativeCloudExtension</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MediaBankGoldCreativeCloudExtension</string>
		<key>PACKAGE_ID</key>
		<string>com.opentext.MediaBankGoldCreativeCloudExtension.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.MediaBankGoldCC2018</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/MediaBank Gold Installer.app/Contents/Resources/MediaBankGold.zxp</string>
				<key>archive_format</key>
				<string>zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/MediaBankGoldzxp_unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\t version="([\d\.]+)"</string>
				<key>result_output_var_name</key>
				<string>major_version</string>
				<key>url</key>
				<string>file:///%RECIPE_CACHE_DIR%/MediaBankGoldzxp_unarchive/MediaBankGold.mxi</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Build Date - (\d+)&lt;br&gt;</string>
				<key>result_output_var_name</key>
				<string>build_date</string>
				<key>url</key>
				<string>file:///%RECIPE_CACHE_DIR%/MediaBankGoldzxp_unarchive/MediaBankGold.mxi</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe</key>
					<string>0775</string>
					<key>Library/Application Support/Adobe/CEP</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/CEP/extensions</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/CEP/extensions/com.wavecorp.cm.plugin.MediaBankGold</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/MediaBankGoldzxp_unarchive/MediaBankGold.zxp</string>
				<key>archive_format</key>
				<string>zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/CEP/extensions/com.wavecorp.cm.plugin.MediaBankGold</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Library/Application Support</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%PACKAGE_ID%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%major_version%.%build_date%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
