<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest InPreflight Pro disk image and imports a CC 2014-aimed package into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.InPreflightProCC2014</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InPreflightProCC2014</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/zevrixsolutions</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>InPreflight Pro</string>
				<string>Deliver</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-zevrixsolutions-%NAME%</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>InPreflight is a powerful all-in-one solution to check InDesign documents, collect them for output and ship to final destination.</string>
			<key>developer</key>
			<string>Zevrix Solutions</string>
			<key>display_name</key>
			<string>InPreflight Pro CC 2014</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InDesignCC2014</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.InPreflightProCC2014</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
