<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Output Factory disk image and imports a CS6-aimed package into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.OutputFactoryCS6</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/zevrixsolutions</string>
		<key>NAME</key>
		<string>OutputFactoryCS6</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Output Factory</string>
				<string>Deliver</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-zevrixsolutions-OutputFactoryCS6</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>Output Factory is the ultimate solution to automate InDesign's output tasks - whether you need to send hundreds of documents or just a single one.</string>
			<key>developer</key>
			<string>Zevrix Solutions</string>
			<key>display_name</key>
			<string>Output Factory CS6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InDesignCS6</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.OutputFactoryCS6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
