<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download FontExplorer X Pro 5.5 plugins from Monotype's plugin update URL.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.FontExplorerXPro55Plugins</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FontExplorerXPro55Plugins</string>
		<key>UPDATE_URL</key>  <!-- Note this isn't Sparkle-formatted XML, it's a plist -->
		<string>http://fex.linotype.com/update/client/mac/pro/plugins-5.5/appcast-small.plist</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%UPDATE_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%</string>
				<key>plist_keys</key>
				<dict>
					<key>url</key>
					<string>update_filename</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://fex.linotype.com/update/client/mac/pro/plugins-5.5/%update_filename%</string>
			</dict>
		</dict>
<!--	CodeSignatureVerifier doesn't support bundles, yet.  If CodeSignatureVerifier.py is
		modified to support the .bundle file type, the below invocation of CodeSignatureVerifier
		works.

		https://github.com/autopkg/autopkg/blob/master/Code/autopkglib/CodeSignatureVerifier.py#L244-L248
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/decompress</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/decompress/PlugIns.bundle</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Linotype GmbH</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
 -->
 		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>