<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Image Processor Pro.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.ImageProcessorPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ImageProcessorPro</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;link&gt;(https:\/\/sourceforge\.net\/projects\/ps-scripts\/files\/Image%20Processor%20Pro\/.*\/ImageProcessorPro-.*\.zip\/download)&lt;\/link&gt;</string>
				<key>result_output_var_name</key>
				<string>found_url</string>
				<key>url</key>
				<string>https://sourceforge.net/projects/ps-scripts/rss?path=/Image%20Processor%20Pro</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>ImageProcessorPro.zip</string>
				<key>url</key>
				<string>%found_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
