<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Image Processor Pro and creates a Photoshop 2022-aimed package.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ImageProcessorProPhotoshopCC2022</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ImageProcessorProPhotoshopCC2022</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ImageProcessorPro</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>-- v([\d\.a-zA-Z]+) --</string>
				<key>result_output_var_name</key>
				<string>discovered_version</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/README.txt</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Applications/Adobe Photoshop 2022</key>
					<string>0775</string>
					<key>Applications/Adobe Photoshop 2022/Presets</key>
					<string>0775</string>
					<key>Applications/Adobe Photoshop 2022/Presets/Scripts</key>
					<string>0775</string>
					<key>Applications/Adobe Photoshop 2022/Presets/Scripts/icons</key>
					<string>0775</string>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Startup Scripts CC</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Startup Scripts CC/Adobe Photoshop</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/Image Processor Pro.jsx</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/Image Processor Pro.xml</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/Image Processor Pro</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/Image Processor Pro</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/icons</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/icons/one.png</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/icons</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/icons/two.png</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/icons</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/icons/three.png</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/icons</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/icons/four.png</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe Photoshop 2022/Presets/Scripts/icons</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/icons/five.png</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/Startup Scripts CC/Adobe Photoshop</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/ImageProcessorPro/photoshop_ximage_processor_pro.jsx</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>net.sourceforge.ImageProcessorProPhotoshopCC2022.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%discovered_version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%discovered_version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
