<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>"Downloads" Optical Flares for installation.  This recipe does not download the Optical Flares zip archive--feed the zip archive into the recipe via the following format:

autopkg run OpticalFlares.download -p /path/to/OpticalFlaresInstaller_1.3.5_Mac_2020.zip</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.OpticalFlares</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpticalFlares</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Not going to tackle downloading the software</string>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%PKG%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%found_filename%/OpticalFlaresInstaller.app</string>
				<key>requirement</key>
				<string>identifier "net.videocopilot.OpticalFlaresInstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "462FK78NZ8"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
