<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>"Downloads" Optical Flares, packages it for installation under After Effects CC 2019, and imports the package into Munki.

WARNING: The POSIX permissions in this recipe on the "VideoCopilot" folder are 0777 since this is the location where Video Copilot wants to place the license.  This can be changed by overriding the permissions in the "Input".

NOTE: This recipe does not download the Optical Flares zip archive--feed the zip archive into the recipe via the following format:

autopkg run OpticalFlaresAfterEffectsCC2019.munki -p /path/to/OpticalFlaresInstaller_1.3.5_Mac_2020.zip</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.OpticalFlaresAfterEffectsCC2019</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/videocopilot</string>
		<key>NAME</key>
		<string>OpticalFlaresAfterEffectsCC2019</string>
		<key>VIDEOCOPILOT_FOLDER_PERMISSIONS</key>
		<string>0777</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>After Effects CC 2019</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-videocopilot-OpticalFlaresAfterEffectsCC2019</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Optical Flares is a plug-in for designing and animating realistic lens flares in After Effects.</string>
			<key>developer</key>
			<string>Video Copilot</string>
			<key>display_name</key>
			<string>Optical Flares After Effects CC 2019</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>AfterEffectsCC2019</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.OpticalFlaresAfterEffectsCC2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
