<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>"Downloads" Pro Presets and packages it for installation under After Effects CC 2019.

WARNING: The POSIX permissions in this recipe on the "VideoCopilot" folder are 0777 since this is the location where Video Copilot wants to place the license--0777 rights allows a non-admin to license Video Copilot without admin assistance.  This can be changed by overriding the VIDEOCOPILOT_FOLDER_PERMISSIONS permissions in the "Input".
	
NOTE:
- This recipe cannot determine the version of Pro Presets and must have it fed in as Input, whether via override or via CLI with -k
- This recipe does not download the Pro Presets zip archive--feed the zip archive into the recipe via -p

The sum of the two notes above would lead to an example run of this recipe as follows:

autopkg run ProPresetsAfterEffectsCC2019.pkg -p /path/to/Pro_Presets.zip -k VERSION=2020.11.25</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ProPresetsAfterEffectsCC2019</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ProPresetsAfterEffectsCC2019</string>
		<key>VERSION</key>
		<string>please.set.me</string>
		<key>VIDEOCOPILOT_FOLDER_PERMISSIONS</key>
		<string>0777</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>VERSION == "please.set.me"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects CC 2019</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects CC 2019/Plug-ins</key>
					<string>0755</string>
					<key>Applications/Adobe After Effects CC 2019/Plug-ins/VideoCopilot</key>
					<string>%VIDEOCOPILOT_FOLDER_PERMISSIONS%</string>
					<key>Applications/Adobe After Effects CC 2019/Plug-ins/VideoCopilot/Optical Flares Presets</key>
					<string>0755</string>
					<key>Applications/Adobe After Effects CC 2019/Plug-ins/VideoCopilot/Optical Flares Presets/Lens Flares</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%PKG%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects CC 2019/Plug-ins/VideoCopilot/Optical Flares Presets/Lens Flares/Pro Presets</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/Pro Presets</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Applications/Adobe After Effects CC 2019/Plug-ins</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>net.videocopilot.ProPresetsAfterEffectsCC2019.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%VERSION%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%VERSION%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
