<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>"Downloads" Optical Flares and packages it for installation under After Effects CC 2020.

WARNING: The POSIX permissions in this recipe on the "VideoCopilot" folder are 0777 since this is the location where Video Copilot wants to place the license--0777 rights allows a non-admin to license Video Copilot without admin assistance.  This can be changed by overriding the VIDEOCOPILOT_FOLDER_PERMISSIONS permissions in the "Input".

NOTE:

- This recipe does not download the Optical Flares zip archive--feed the zip archive into the recipe via the following format:

autopkg run OpticalFlaresAfterEffectsCC2020.pkg -p /path/to/OpticalFlaresInstaller_1.3.5_Mac_2020.zip

- This recipe depends on jessepeterson's ModeChanger.  Add jessepeterson's repo via:

autopkg repo-add jessepeterson-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.OpticalFlaresAfterEffectsCC2020</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpticalFlaresAfterEffectsCC2020</string>
		<key>VIDEOCOPILOT_FOLDER_PERMISSIONS</key>
		<string>0777</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.OpticalFlares</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects 2020</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects 2020/Plug-ins</key>
					<string>0755</string>
					<key>Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%PKG%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/OpticalFlaresInstaller.app/Contents/Resources/OpticalFlares64.plugin/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot/OpticalFlares.plugin</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%/OpticalFlaresInstaller.app/Contents/Resources/OpticalFlares64.plugin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot/Optical Flares Presets</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%/OpticalFlaresInstaller.app/Contents/Resources/Package_OpticalFlares/Optical Flares Presets</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot/Optical Flares Textures</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%/OpticalFlaresInstaller.app/Contents/Resources/Package_OpticalFlares/Optical Flares Textures</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot</string>
				<key>mode</key>
				<string>%VIDEOCOPILOT_FOLDER_PERMISSIONS%</string>
			</dict>
			<key>Comment</key>
			<string>POSIX permissions change here so non-admins could license Optical Flares if desired.</string>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Applications/Adobe After Effects 2020/Plug-ins</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>Applications/Adobe After Effects 2020/Plug-ins/VideoCopilot</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>net.videocopilot.OpticalFlaresAfterEffectsCC2020.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
