<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Deconstruct a Fiery driver package, remove the Fiery Driver Updater.app, and repack.  The FD50 and FD51-revision Fiery drivers appear to properly handle installing when COMMAND_LINE_INSTALL is set.

To start, download a FD50 or FD51 driver from:
http://www.efi.com/support-and-downloads/download-registration/

Note the name of the downloaded driver dmg (e.g. "Ricoh_E41_v1_0R_FD51_v1Cert.dmg") and create an override using the dmg name:
autopkg make-override GenericFieryFD50.pkg -n Ricoh_E41_v1_0R_FD51_v1Cert.pkg

Set the Input in the override to the following suggested items:
- NAME of the downloadable DMG without ".dmg", and adding "_No_Update" (e.g. Ricoh_E41_v1_0R_FD51_v1Cert_No_Update)
- PACKAGE_ID of com.efi.DMG-Name-with-hyphens-substituted-for-underscores.pkg
  (e.g. com.efi.Ricoh-E41-v1-0R-FD51-v1Cert.pkg)
- PACKAGE_VERSION of 1.$version, where $version is the digits after "FD" in the downloaded driver (e.g. 1.51)

Run the recipe with the "-p" option pointing to the downloaded driver dmg:
autopkg run Ricoh_E41_v1_0R_FD51_v1Cert.pkg -p /path/to/Ricoh_E41_v1_0R_FD51_v1Cert.dmg

Also note that the way that EFI's package postinstall is written causes it to behave differently when COMMAND_LINE_INSTALL is set.  When testing the output package, make sure to use "installer" rather than double-clicking the package.  From a different point of view, when the package output from this recipe installed via the GUI (i.e. Installer.app) it will NOT have the desired result of skipping the Fiery Driver Updater installation and running non-interactively.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.GenericFieryFD50</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>%NAME%</string>
		<key>PACKAGE_ID</key>
		<string>com.efi.replace-me-in-an-override.pkg</string>
		<key>PACKAGE_VERSION</key>
		<string>1.50</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.GenericFieryFD50</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%PKG%/Fiery Printer Driver.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>tmp</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/tmp/Fiery Printer Driver Installer.app</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/FieryPrinterDriverInstaller.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/tmp/Fiery Printer Driver Installer.app/Contents/Resources/User Software/OSX/Printer Driver/Fiery Driver Updater.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%PACKAGE_ID%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/unpack/FieryPrinterDriverInstaller.pkg/Scripts</string>
					<key>version</key>
					<string>%PACKAGE_VERSION%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
