<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Dr Brown's Services and imports a CS6-aimed package into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.DrBrownsServicesCS6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DrBrownsServicesCS6</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/russellbrown</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-russellbrown-DrBrownsServicesCS6</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>Dr. Brown's Services is a collection of time-saving utilities for designers and photographers.</string>
			<key>developer</key>
			<string>Russell Brown</string>
			<key>display_name</key>
			<string>Dr. Brown's Services for Photoshop CS6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>update_for</key>
			<array>
				<string>PhotoshopCS6</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.DrBrownsServicesCS6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>