<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Dr Brown's Services.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.DrBrownsServicesCS6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DrBrownsServices</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.russellbrown.com/scripts.html</string>
				<key>re_pattern</key>
				<string>(images/tips_downloads/Services_Installer.*.zip)</string>
				<key>result_output_var_name</key>
				<string>partial_url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.russellbrown.com/%partial_url%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
