<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Disk Arbitrator.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.DiskArbitrator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DiskArbitrator</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/aburgh/Disk-Arbitrator/wiki/Downloads</string>
				<key>re_pattern</key>
				<string>(https://kainjow.com/downloads/.*.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Disk Arbitrator.app</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Kevin Wojniak</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
