<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Call Recorder for Skype installer and uses it to create a package.

Note: CUSTOMER_EMAIL and REG_CODE _must_ be overridden in order for this recipe to work.

Log in to your Ecamm customer center and inspect the URL for these values:
- The CUSTOMER_EMAIL is the "u" parameter. It's your customer email address, URL-encoded.
- The REG_CODE is the "c" parameter, a six-character string.

Example (spaces added for clarity):
https://www.ecamm.com/cgi-bin/customercenter ? u=john%2Edoe%40example%2Ecom &amp; c=XYZ123

- Call Recorder for Skype removes the code signature from a Skype component.  This is set in the
postinstall script, but defaults to _not_ performing the code signature removal.  Please change
this in the override to indicate understanding of the change to Skype.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.CallRecorderforSkype</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CallRecorderforSkype</string>
		<key>POSTINSTALL_SCRIPT</key>
		<string>#!/bin/bash

pathToChange="/Applications/Skype.app/Contents/Frameworks/Skype Helper (Renderer).app"

#Uncomment the next line if removing the code signature to allow Call Recorder for Skype to load
#is understood and the risks are accepted
#codesign --remove-signature "${pathToChange}"</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.CallRecorderforSkype</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/contents.tar</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/Call Recorder */Install Call Recorder.app/Contents/Resources/contents.einstall</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/contents.tar</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive_einstall</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive_einstall/CallRecorder.plugin/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support/EcammVideoPlugins</key>
					<string>0755</string>
					<key>Library/CoreMediaIO</key>
					<string>0755</string>
					<key>Library/CoreMediaIO/Plug-Ins</key>
					<string>0755</string>
					<key>Library/CoreMediaIO/Plug-Ins/DAL</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Ecamm Movie Tools.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive_einstall/Ecamm Movie Tools.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/EcammVideoPlugins/CallRecorder.plugin</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive_einstall/CallRecorder.plugin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/CoreMediaIO/Plug-Ins/DAL/EcammVideoLoader.plugin</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive_einstall/EcammVideoLoader.plugin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>%POSTINSTALL_SCRIPT%</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.ecamm.CallRecorderforSkype.pkg</string>
					<key>pkgname</key>
					<string>CallRecorderforSkype-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
