<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Capture One and imports it into Munki for use with perpetually-licensed Capture One.

Notes:

- Major version upgrades of Capture One are now judged by the first and second dotted sections of the version number.  Capture One 16.3 is a major version, and the forthcoming 16.4 will also be a major version--and perpetual licenses only cover a single major version.
Reference: https://support.captureone.com/hc/en-us/community/posts/14386195229085-Capture-One-Pro-16-3-is-out-now-and-we-want-to-thank-you-

This recipe is made for Capture One when licensed perpetually and has the following unique features/options when compared to the recipe for the subscription version of Capture One:

- Has a Munki "name" of "CaptureOneX.Y" ("name"-"first_decimal_section"-"second_decimal_section") as opposed to the static name used in the subscription recipe
- STOP_ON_NO_NEW_DOWNLOAD Option: Skips import if no new file was retrieved in the "download" recipe (defaults to true).  Assuming a stable ETag, this allows the recipe to run (typically in an automated fashion) with force_munkiimport set to true but avoiding duplicate imports.  This allows this recipe for perpetually-licensed Capture One to run in tandem with the subscription-licensed Capture One recipe
- FORCE_MUNKIIMPORT Option: Controls whether force_munkiimport is enabled (defaults to true (the string value is set), switch to an empty set of string tags for false).  This allows the AutoPkg admin to control the force_munkiimport behavior in case it is required
- PREFERRED_CATALOG, PREFERRED_DISPLAY_NAME, and PREFERRED_NAME keys will allow an override to completely override the corresponding values in the Munki pkginfo (excluding the pipe character in the override-supplied value, since the pipe is used as a delimiter in the "TextSearcher" processor)
- This recipe depends on jazzace's TextSearcher.  Add jazzace's repo via:

autopkg repo-add jazzace-recipes

Expected uses of this recipe:

- Capture One perpetual and Capture One subscription are in use: Recipe left in default state (STOP_ON_NO_NEW_DOWNLOAD is true, FORCE_MUNKIIMPORT is set)
- Only Capture One perpetual licensing is in use: STOP_ON_NO_NEW_DOWNLOAD is overridden to false, FORCE_MUNKIIMPORT is overridden to a null/empty string (although the behavior _should_ be acceptable even if these variables are not overridden)</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.CaptureOne</string>
	<key>Input</key>
	<dict>
		<key>FORCE_MUNKIIMPORT</key>
		<string>totally</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/phaseone</string>
		<key>NAME</key>
		<string>CaptureOne</string>
		<key>PREFERRED_CATALOG</key>
		<string></string>
		<key>PREFERRED_DISPLAY_NAME</key>
		<string></string>
		<key>PREFERRED_NAME</key>
		<string></string>
		<key>STOP_ON_NO_NEW_DOWNLOAD</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The professional choice in imaging software.</string>
			<key>developer</key>
			<string>Phase One</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.CaptureOne</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE AND STOP_ON_NO_NEW_DOWNLOAD == TRUE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\"latestCOVersions\":.+?https://downloads\.captureone\.pro/d/mac/[A-Za-z\d]+/CaptureOne\.Mac\.([\d]+\.[\d]+)[\d\.]+\.dmg</string>
				<key>result_output_var_name</key>
				<string>perpetual_version</string>
				<key>url</key>
				<string>https://www.captureone.com/en/account/download-trial</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>concatenated_catalog</key>
				<string>%PREFERRED_CATALOG%|development-phaseone-%NAME%%perpetual_version%</string>
				<key>concatenated_display_name</key>
				<string>%PREFERRED_DISPLAY_NAME%|Capture One %perpetual_version%</string>
				<key>concatenated_name</key>
				<string>%PREFERRED_NAME%|%NAME%%perpetual_version%</string>
				<key>note</key>
				<string>This processor is being used to copy variables around.</string>
			</dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>[^|]+</string>
				<key>result_output_var_name</key>
				<string>calculated_catalog</string>
				<key>text_in</key>
				<string>%concatenated_catalog%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>[^|]+</string>
				<key>result_output_var_name</key>
				<string>calculated_display_name</string>
				<key>text_in</key>
				<string>%concatenated_display_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>[^|]+</string>
				<key>result_output_var_name</key>
				<string>calculated_name</string>
				<key>text_in</key>
				<string>%concatenated_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>%calculated_catalog%</string>
					</array>
					<key>display_name</key>
					<string>%calculated_display_name%</string>
					<key>name</key>
					<string>%calculated_name%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>force_munkiimport</key>
				<string>%FORCE_MUNKIIMPORT%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
