<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Capture One and imports it into Munki.

Note major version upgrades of Capture One are generally paid upgrades, however Phase One's update URL doesn't stop at major version boundaries (e.g. the update URL for Capture One 7 offers a download of Capture One 9) and new major versions of Capture One are paid updates.

In an attempt to avoid accidentally downloading (and subsequently importing) Capture One updates that require a paid update, we restrict to an ACTUAL_VERSION.  When Phase One releases a new major version, this recipe will break until ACTUAL_VERSION are updated (either via override or by updating this recipe).

Due to Phase One's decision to go with different versions for the software itself and marketing (e.g. Capture One version 13 is marketed as version 20), this recipe also has a MARKETING_VERSION variable to account for the discrepancy.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.CaptureOne</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/phaseone</string>
		<key>NAME</key>
		<string>CaptureOne</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-phaseone-%NAME%%MARKETING_VERSION%</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The professional choice in imaging software.</string>
			<key>developer</key>
			<string>Phase One</string>
			<key>display_name</key>
			<string>Capture One %MARKETING_VERSION%</string>
			<key>name</key>
			<string>%NAME%%MARKETING_VERSION%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.CaptureOne</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
