<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Capture One.

Note major version upgrades of Capture One are generally paid upgrades, however Phase One's update URL doesn't stop at major version boundaries (e.g. the update URL for Capture One 7 offers a download of Capture One 9) and new major versions of Capture One are paid updates.

In an attempt to avoid accidentally downloading (and subsequently importing) Capture One updates that require a paid update, we restrict to an ACTUAL_VERSION.  When Phase One releases a new major version, this recipe will break until ACTUAL_VERSION are updated (either via override or by updating this recipe).

Due to Phase One's decision to go with different versions for the software itself and marketing (e.g. Capture One version 13 is marketed as version 20), this recipe also has a MARKETING_VERSION variable to account for the discrepancy.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.CaptureOne</string>
	<key>Input</key>
	<dict>
		<key>ACTUAL_VERSION</key>
		<string>14</string>
		<key>MARKETING_VERSION</key>
		<string>21</string>
		<key>NAME</key>
		<string>CaptureOne</string>
		<key>LANGUAGE</key>
		<string>International</string>
		<key>CODESIGNATUREVERIFIERREQUIREMENT</key>
		<string>anchor apple generic and identifier "com.captureone.captureone14" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5WTDB5F65L")</string>
		<key>DOWNLOADURLUUID</key>
		<string>5059f2ea-b489-4f19-8e68-3b359e11d00a</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;AvailableVersion&gt;(%ACTUAL_VERSION%[\.\d]*)&lt;\/AvailableVersion&gt;</string>
				<key>result_output_var_name</key>
				<string>truncated_version</string>
				<key>url</key>
				<string>https://cormws.phaseone.com/corm.asmx/GetNewSoftwareVersion?Platform=Mac&amp;Version=8.0</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>CaptureOne.dmg</string>
				<key>url</key>
				<string>https://downloads.phaseone.com/%DOWNLOADURLUUID%/%LANGUAGE%/CaptureOne%MARKETING_VERSION%.Mac.%truncated_version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Capture One %MARKETING_VERSION%.app</string>
				<key>requirement</key>
				<string>%CODESIGNATUREVERIFIERREQUIREMENT%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
