<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Nik Collection, packages it for Photoshop CC 2015, and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.NikCollectionPSCC2015</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/google</string>
		<key>NAME</key>
		<string>NikCollectionPSCC2015</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Photoshop CC 2015</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-google-NikCollectionPSCC2015</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Create stunning images faster. Add the power of the Nik Collection by Google to your workflow today.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Nik Collection for Photoshop CC 2015</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>PhotoshopCC2015</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.NikCollectionPSCC2015</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
