<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Quite Imposing 4 Plus disk image and packages it for Acrobat DC.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.QuiteImposing4PlusAcrobatDC</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>en</string>
		<key>MAJOR_VERSION</key>
		<string>4</string>
		<key>NAME</key>
		<string>QuiteImposing4PlusAcrobatDC</string>
		<key>PLUS</key>
		<string>plus</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.QuiteImposing</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Install Quite Plug-ins.app/Contents/Resources/Products/QI+ 4 XB.acroplugin/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe</key>
					<string>0775</string>
					<key>Library/Application Support/Adobe/Acrobat</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Acrobat/DC</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Acrobat/DC/Plug-ins</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/Acrobat/DC/Plug-ins</string>
				<key>source_path</key>
				<string>%pathname%/Install Quite Plug-ins.app/Contents/Resources/Products/QI+ 4 gd en.pdf</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/Acrobat/DC/Plug-ins</string>
				<key>source_path</key>
				<string>%pathname%/Install Quite Plug-ins.app/Contents/Resources/Products/QI+ 4 gs en.pdf</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/Acrobat/DC/Plug-ins/QI+ 4 XB.acroplugin</string>
				<key>source_path</key>
				<string>%pathname%/Install Quite Plug-ins.app/Contents/Resources/Products/QI+ 4 XB.acroplugin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Adobe/Acrobat/DC/Plug-ins</string>
				<key>source_path</key>
				<string>%pathname%/Install Quite Plug-ins.app/Contents/Resources/Products/QI+ 4 readme en.pdf</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.quite.QuiteImposing4PlusAcrobatDC.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
