<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of ColorMunki Photo and modifies a postinstall to handle a potentially not-renamed /Applications/ColorMunkiPhoto from versions of ColorMunki Photo before 1.2.2. 

NOTES:
- This recipe depends on hjuutilainen's ChecksumVerifier.  Add this repo via:

autopkg repo-add hjuutilainen-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ColorMunkiPhoto</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorMunkiPhoto</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ColorMunkiPhoto</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Appears this application is 32 bit and has been replaced with i1Studio.  This recipe will soon be removed.</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/ColorMunki Photo.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>74964896c7c9d33a8c3ff1eae9bdc2a8</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/unpack/XRD_Manager_Component.pkg/Scripts/postinstall</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches XRD_Manager_Component.pkg postinstall script from ColorMunki Photo 1.2.2</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack/XRD_Manager_Component.pkg/Scripts/postinstall</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>A mix of their postinstall plus my deletion of /Applications/ColorMunkiPhoto, if necessary</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
##Edit to remove /Applications/ColorMunkiPhoto, if it exists
##Realize that this package will still not install properly on a non-boot volume
pathToDelete="/Applications/ColorMunkiPhoto"
if [ -d "${pathToDelete}" ]
then
	rm -rf "${pathToDelete}"
fi

echo "Updating launch agent permissions..."
chown root:wheel "/Library/LaunchAgents"
chmod 755 "/Library/LaunchAgents"
chown root:wheel "/Library/LaunchAgents/com.xrite.device.softwareupdate.plist"
chmod 644 "/Library/LaunchAgents/com.xrite.device.softwareupdate.plist"

echo "Updating launch daemon permissions..."
chown root:wheel "/Library/LaunchDaemons"
chmod 755 "/Library/LaunchDaemons"
chown root:wheel "/Library/LaunchDaemons/com.xrite.device.xrdd.plist"
chmod 644 "/Library/LaunchDaemons/com.xrite.device.xrdd.plist"

echo "Creating symlink in /Library/Frameworks..."
ln -Ffs "/Library/Application Support/X-Rite/Frameworks/XRiteDevice.framework" "/Library/Frameworks/XRiteDevice.framework"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/XRD_Manager_Component.pkg/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/repack</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/ColorMunki Photo.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
	</array>
</dict>
</plist>
