<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages Evolphin Zoom for installation.

NOTES:
- This recipe depends on hjuutilainen's ChecksumVerifier.  Add this repo via:
autopkg repo-add hjuutilainen-recipes

- This recipe depends on jessepeterson's ModeChanger.  Add jessepeterson's repo via:
autopkg repo-add jessepeterson-recipes

- This recipe does not download the Evolphin Zoom package--feed the package into the recipe via the following format:
autopkg run EvolphinZoom.pkg -p /path/to/EvolphinZoom.pkg</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.EvolphinZoom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EvolphinZoom</string>
		<key>POSTINSTALL_SCRIPT_PATH</key>
		<string>%RECIPE_DIR%/Reference Evolphin Zoom Scripts/Fixed Scripts/722_postinstall_modified</string>
		<key>PREINSTALL_SCRIPT_PATH</key>
		<string>%RECIPE_DIR%/Reference Evolphin Zoom Scripts/Fixed Scripts/722_preinstall_modified</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Not going to tackle downloading the software right now</string>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%PKG%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Comment</key>
			<string>Unpack the package</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>b829d3f425856c5a0f06d7ad4b537af6</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/preinstall</string>
			</dict>
			<key>Comment</key>
			<string>Verify "preinstall" MD5 matches 7.2.2 release 58</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>1ee65da5a523b1f227a1bf36baae193f</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/postinstall</string>
			</dict>
			<key>Comment</key>
			<string>Verify "postinstall" MD5 matches 7.2.2 release 58</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>5c9aa8340bf5186d4baa4344f852cf77</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/payload_zoom/zoom/Resources/bin/uninstall</string>
			</dict>
			<key>Comment</key>
			<string>Verify "uninstall" MD5 matches 7.2.2 release 58</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>dcfaf53236397eab4ff0e9baf5e60d71</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/payload_zoom/zoom/Uninstall Zoom.app/Contents/Resources/Scripts/main.scpt</string>
			</dict>
			<key>Comment</key>
			<string>Verify "main.scpt" MD5 matches 7.2.2 release 58</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/preinstall</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Delete "preinstall" in prep for it to be replaced</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/preinstall</string>
				<key>source_path</key>
				<string>%PREINSTALL_SCRIPT_PATH%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/preinstall</string>
				<key>mode</key>
				<string>755</string>
			</dict>
			<key>Comment</key>
			<string>755 POSIX permissions since the postinstall needs to be executable</string>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/postinstall</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Delete "postinstall" in prep for it to be replaced</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/postinstall</string>
				<key>source_path</key>
				<string>%POSTINSTALL_SCRIPT_PATH%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoom.pkg/Scripts/postinstall</string>
				<key>mode</key>
				<string>755</string>
			</dict>
			<key>Comment</key>
			<string>755 POSIX permissions since the postinstall needs to be executable</string>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.UniversalTypeClient6/ModeChanger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/repack</string>
			</dict>
			<key>Comment</key>
			<string>Prep to flatten the now-fixed package</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/EvolphinZoom.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Comment</key>
			<string>Flatten the fixed package</string>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
	</array>
</dict>
</plist>
