<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Proper Fraction Lite disk image, packages the Proper Fraction Lite H+V Scale script for InDesign CC 2020, and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.ProperFractionLiteHVScaleInDesignCC2020</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/danrodney</string>
		<key>NAME</key>
		<string>ProperFractionLiteHVScaleInDesignCC2020</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-danrodney-ProperFractionLiteHVScaleInDesignCC2020</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The most complete solution to make fractions in Adobe InDesign and InCopy</string>
			<key>developer</key>
			<string>Dan Rodney</string>
			<key>display_name</key>
			<string>Proper Fraction Lite H+V Scale</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>InDesignCC2020</string>
			</array>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.ProperFractionLiteHVScaleInDesignCC2020</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>