<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Komodo IDE.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.KomodoIDE</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://komodoide.com/download/ide-osx/</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http://.*?Komodo-IDE.*?dmg)</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>curl/7.37.1</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Komodo IDE*</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Todd Whiteman</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
