<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Komodo IDE.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.KomodoIDE</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Appears this recipe will need some significant surgery soon, and since we're no longer using this I'm going to deprecate it.  This recipe will soon be removed.

Please see https://github.com/autopkg/dataJAR-recipes/tree/master/Komodo%20IDE for an alternative set of recipes.</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://downloads\.activestate\.com/Komodo/releases/[\d\.]+/Komodo-IDE-[\d\.-]+-macosx-x86_64\.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>curl/7.37.1</string>
				</dict>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.activestate.com/komodo-ide/downloads/ide</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Komodo IDE*</string>
				<key>requirement</key>
				<string>identifier "com.activestate.KomodoIDE" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6L3MMJ36R9"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
