<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Meteorologist (a.k.a. Meteo).</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.Meteorologist</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Meteorologist</string>
		<key>VERSION_URL</key>
		<string>http://heat-meteo.sourceforge.net/VERSION2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>.*</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Meteorologist/1 CFNetwork/901.1 Darwin/17.6.0 (x86_64)</string>
				</dict>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>%VERSION_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>SOURCEFORGE_PROJECT_NAME</key>
				<string>heat-meteo</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/SourceForgeBestReleaseURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/RemoteFilenameFinder</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.heat.Meteorologist" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7WNRPT262U")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
