<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most current FontAgent 7 Plugin for InCopy CC 2014 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.FontAgent7PluginICCC2014</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/insidersoftware</string>
		<key>NAME</key>
		<string>FontAgent7PluginICCC2014</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe InCopy CC2014</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-insidersoftware-FontAgent7PluginICCC2014</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Plugin to allow InCopy CC 2014 to activate document fonts from FontAgent.</string>
			<key>developer</key>
			<string>Insider Software</string>
			<key>display_name</key>
			<string>FontAgent plugin for InCopy CC 2014</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>InCopyCC2014</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.FontAgent7PluginICCC2014</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
