<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most current FontAgent 9 Plugin for InDesign CC 2017 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.FontAgent9PluginIDCC2018</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/insidersoftware</string>
		<key>NAME</key>
		<string>FontAgent9PluginIDCC2018</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe InDesign CC 2018</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-insidersoftware-FontAgent9PluginIDCC2018</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Plugin to allow InDesign CC 2018 to activate document fonts from FontAgent.</string>
			<key>developer</key>
			<string>Insider Software</string>
			<key>display_name</key>
			<string>FontAgent plugin for InDesign CC 2018</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>InDesignCC2018</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.FontAgent9PluginIDCC2018</string>
	<key>Process</key>
	<array>
		<dict>
 			<key>Processor</key>
 			<string>DeprecationWarning</string>
 			<key>Arguments</key>
 			<dict>
 				<key>warning_message</key>
 				<string>Insider Software only supports the current and previous two versions of CC applications.  This recipe will soon be removed.</string>
 			</dict>
 		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
