<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage the Frame.io Panel and import it into Munki.

NOTE:

- This recipe does not download the Frame.io package--feed the package into the recipe via the following format:
autopkg run FrameioPanel.munki -p /path/to/FrameioPanel_280.zxp</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.FrameioPanel</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/frameio</string>
		<key>NAME</key>
		<string>FrameioPanel</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe After Effects CC 2018</string>
				<string>Adobe After Effects CC 2019</string>
				<string>Adobe After Effects 2020</string>
				<string>Adobe After Effects 2021</string>
				<string>Adobe Premiere Pro CC 2019</string>
				<string>Adobe Premiere Pro 2020</string>
				<string>Adobe Premiere Pro 2021</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-frameio-FrameioPanel</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The modern video workflow, (re)defined</string>
			<key>developer</key>
			<string>Frame.io</string>
			<key>display_name</key>
			<string>Frame.io Panel</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.FrameioPanel</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>