<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Film Impact Plugins (a.k.a. Film Impact Premium Video Transitions) package and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.filmimpactplugins</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/filmimpact</string>
		<key>NAME</key>
		<string>FilmImpactPlugins</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Premiere Pro 2021</string>
				<string>Adobe Premiere Pro 2022</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-filmimpact-FilmImpactPlugins</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Discover our premium video transitions for Premiere Pro. Film Impact builds smooth, professional, and seamless transitions.</string>
			<key>developer</key>
			<string>Film Impact</string>
			<key>display_name</key>
			<string>Film Impact Plugins</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.filmimpactplugins</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Film Impact Premium Video Effects.pkg</string>
				<key>source_path</key>
				<string>%pathname%/Film Impact Premium Video Effects.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/Film Impact Premium Video Effects.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
