<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Google Ads Editor disk image and builds an installation package.

NOTES:
- When "Google Ads Editor" version 1.0 was released, the versioning for Ads Editor was reset to 1.0 even though the actual software went to version 13.  Subtract 12 from the major version to get the marketing version of Google Ads Editor (e.g. 13-12=1)
- This package carries the Google Keystone updater.  To get rid of the Keystone updater, run the following script in your software management system following installation:

###
#!/bin/bash

rm "/Applications/Google Ads Editor.app/Contents/Frameworks/KeystoneRegistration.framework/Versions/A/Resources/Keystone.tbz" \
"/Applications/Google Ads Editor.app/Contents/Frameworks/KeystoneRegistration.framework/Versions/A/Resources/ksinstall"
###

- This recipe depends on homebysix's FindAndReplace.  Add homebysix's repo via:

autopkg repo-add homebysix-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.googleadseditor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GoogleAdsEditor</string>
		<key>PKGID</key>
		<string>com.google.googleadwordseditor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.googleadseditor</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root/Applications/Google Ads Editor.app</string>
				<key>source_path</key>
				<string>%pathname%/Google Ads Editor.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0644</string>
							<key>path</key>
							<string>Applications/Google Ads Editor.app/Contents/Info.plist</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0644</string>
							<key>path</key>
							<string>Applications/Google Ads Editor.app/Contents/Versions/%version%/Google Ads Editor.app/Contents/Info.plist</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%PKGID%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkg_root</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
