<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Google Ads Editor disk image, builds an installation package, and imports it into Munki.

NOTES:
- When "Google Ads Editor" version 1.0 was released, the versioning for Ads Editor was reset to 1.0 even though the actual software went to version 13.  Subtract 12 from the major version to get the marketing version of Google Ads Editor (e.g. 13-12=1)
- This package carries the Google Keystone updater.  To get rid of the Keystone updater, set the following postuninstall_script in your override

###
#!/bin/bash

rm "/Applications/Google Ads Editor.app/Contents/Frameworks/KeystoneRegistration.framework/Versions/A/Resources/Keystone.tbz" \
"/Applications/Google Ads Editor.app/Contents/Frameworks/KeystoneRegistration.framework/Versions/A/Resources/ksinstall"
###</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.googleadseditor</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/google</string>
		<key>NAME</key>
		<string>GoogleAdsEditor</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Google Ads Editor</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-google-GoogleAdWords</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>A free application for managing large AdWords accounts.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Ads Editor</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.googleadseditor</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
