<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome Canary disk image and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.googlechromecanary</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/google</string>
		<key>NAME</key>
		<string>GoogleChromeCanary</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-google-GoogleChromeCanary</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Google Chrome Canary has the newest of the new Chrome features. Be forewarned: it's designed for developers and early adopters, and can sometimes break down completely.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome Canary</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
#Remove the Keystone updater
rm -rf /Applications/Google\ Chrome\ Canary.app/Contents/Versions/*/Google\ Chrome\ Framework.framework/Frameworks/KeystoneRegistration.framework
rm -rf /Applications/Google\ Chrome\ Canary.app/Contents/Versions/*/Google\ Chrome\ Framework.framework/Resources/keystone*</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.googlechromecanary</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
