<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Google Chrome Canary disk image.

CodeSignatureVerifier disabled as of 3/22/2016 (verified 7/11/2016) due to "resource envelope is obsolete (custom omit rules)"</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.googlechromecanary</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GoogleChromeCanary</string>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/release2/q/canary/googlechrome.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
