<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Camera RAW.

NOTE: This recipe unfortunately uses an installs array of the md5 of the Camera RAW binary itself.  This is due to poor versioning choices in the plugin.

NOTE: The package has uninstallable set to false because it intersects with Creative Cloud application installations that are not recorded in the traditional receipts database, thus a "removepackages" uninstall would end up removing Camera RAW even though there might be Camera RAW-dependent applications still installed.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.CameraRAW</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.adobe.com/go/acr_installer_mac</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/adobe</string>
		<key>NAME</key>
		<string>CameraRAW</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>AfterEffects</string>
				<string>Bridge</string>
				<string>Photoshop</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-adobe-CameraRAW</string>
			</array>
			<key>description</key>
			<string>Adobe Camera RAW, which lets you import and enhance raw images, has been a must-have tool for professional photographers right since it was first released in 2003.</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Camera RAW</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>uninstallable</key>
			<false/>
			<key>update_for</key>
			<array>
				<string>AfterEffects</string>
				<string>Bridge</string>
				<string>Photoshop</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.CameraRAW</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/%dmg_found_filename%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Application Support</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Plug-Ins</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Plug-Ins/CC</key>
					<string>0755</string>
					<key>Library/Application Support/Adobe/Plug-Ins/CC/File Formats</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Library/Application Support/Adobe/Plug-Ins/CC/File Formats</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Library/Application Support/Adobe/Plug-Ins/CC/File Formats</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CameraRawPlugin.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Library/Application Support/Adobe/Plug-Ins/CC/File Formats/Camera Raw.plugin/Contents/MacOS/Camera Raw</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Library/Application Support/Adobe/Plug-Ins/CC/File Formats/Camera Raw.plugin</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>split_on</key>
				<string> </string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
