<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage an Adobe ZXP extension and import it into Munki.

NOTE:

- This recipe expects an unencrypted .zxp file.  These are NOT available from Adobe Exchange, they either must be obtained from the vendor directly or by building an Admin Console package that contains the Extension (and thus contains the .zxp file)
- It's highly-suggested to create overrides of this recipe with unique names, such as "autopkg make-override GenericZXPRepackage.munki -n FoobarbazExtension.munki"
- The NAME, PACKAGE_ID, EXTENSION_PATH, and MUNKI_REPO_SUBDIR values _must_ be overridden to run this recipe
- EXTENSION_PATH can be determined by installing the extension and looking for the extension name in /Library/Application Support/Adobe/CEP/extensions 
- This recipe does not download the .zxp file--feed the source file into the recipe via the following format:
autopkg run FoobarbazExtension.munki -p /path/to/FoobarbazExtension_Install.pkg/Contents/Resources/post/addon/ZXP/123456.zxp</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.GenericZXPRepackage</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/genericzxprepackage</string>
		<key>NAME</key>
		<string>GenericZXPRepackage</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Foobarbaz 2525</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-vendor-FoobarbazExtension</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>How many times has this happened to you? You have a bass, and you're trying to find an exciting new way to prepare it for the dinner table.</string>
			<key>developer</key>
			<string>Vendor</string>
			<key>display_name</key>
			<string>Foobarbaz</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.GenericZXPRepackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>MUNKI_REPO_SUBDIR == "plugins/genericzxprepackage"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
