<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Wirecast and extracts the Telestream Audio driver package from the dmg.

This recipe is necessary because munkiimport refuses to import the Wirecast dmg (for the purposes of obtaining the Telestream Audio package), and "force_munkiimport" isn't a good idea if this is automated.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.TelestreamAudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TelestreamAudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.Wirecast</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/Wirecast.app/Contents/PlugIns/Sources/SourceSDK/MacCapture/MacCapture.bundle/Contents/Resources/TelestreamAudio.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
