<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Wirecast Virtual Camera package for Wirecast 7 and imports it into Munki.

Note major version upgrades of Wirecast are generally paid upgrades.

NOTE THIS RECIPE DOESN'T DO A WHOLE LOT WITHOUT WIRECAST. This recipe is an update_for Wirecast</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.WirecastVirtualCamera7</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/telestream</string>
		<key>NAME</key>
		<string>WirecastVirtualCamera7</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Wirecast</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-telestream-%NAME%</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Additional drivers for Wirecast features.</string>
			<key>developer</key>
			<string>Telestream</string>
			<key>display_name</key>
			<string>Wirecast Virtual Camera 7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>Wirecast7</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.WirecastVirtualCamera7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
