<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Wirecast.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.Wirecast</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Wirecast</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(/download-files/wirecast/[0-9-]+/Wirecast-[\.0-9]+\.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url_suffix</string>
				<key>url</key>
				<string>http://www.telestream.net/update-check/wirecast/upgrade.htm?premium=no</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>Wirecast.dmg</string>
				<key>url</key>
				<string>http://www.telestream.net%url_suffix%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Wirecast.app</string>
				<key>requirement</key>
				<string>identifier "net.telestream.wirecast"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
