<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of Wirecast.

Note major version upgrades of Wirecast are generally paid upgrades.  Thus override MAJOR_VERSION with your preferred version (currently 4, 5, and 6 work).</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.Wirecast</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>6</string>
		<key>NAME</key>
		<string>Wirecast</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(http://www.telestream.net/download-files/wirecast/%MAJOR_VERSION%-0/Wirecast-%MAJOR_VERSION%[\.0-9]*.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>http://www.telestream.net/update-check/wirecast/upgrade-%MAJOR_VERSION%.htm?os=mac</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Wirecast.app</string>
				<key>requirement</key>
				<string>identifier "com.varasoftware.wirecast"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
