<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Remote Desktop installer pkg and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.microsoftremotedesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/microsoft</string>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Remote Desktop</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>development-microsoft-MicrosoftRemoteDesktop</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>Use the new Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.download.microsoftremotedesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
