<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	 <key>Description</key>
	 <string>Downloads the latest Microsoft Remote Desktop installer pkg and imports it into Munki.</string>
	 <key>Identifier</key>
	 <string>com.github.foigus.munki.microsoftremotedesktop</string>
	 <key>Input</key>
	 <dict>
		  <key>MUNKI_REPO_SUBDIR</key>
		  <string>apps/microsoft</string>
		  <key>NAME</key>
		  <string>MicrosoftRemoteDesktop</string>
		  <key>pkg_ids_set_optional_true</key>
		  <array/>
		  <key>pkginfo</key>
		  <dict>
				<key>blocking_applications</key>
				<array>
					 <string>Microsoft Remote Desktop</string>
				</array>
				<key>catalogs</key>
				<array>
					 <string>development-microsoft-MicrosoftRemoteDesktop</string>
				</array>
				<key>category</key>
				<string>Utility</string>
				<key>description</key>
				<string>Use the new Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
				<key>developer</key>
				<string>Microsoft</string>
				<key>display_name</key>
				<string>Microsoft Remote Desktop</string>
				<key>minimum_os_version</key>
				<string>10.14</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
		  </dict>
	 </dict>
	 <key>MinimumVersion</key>
	 <string>0.2.0</string>
	 <key>ParentRecipe</key>
	 <string>com.github.rtrouton.download.microsoftremotedesktop</string>
	 <key>Process</key>
	 <array>
		  <dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					  <key>destination_path</key>
					  <string>%RECIPE_CACHE_DIR%/unpack</string>
					  <key>flat_pkg_path</key>
					  <string>%pathname%</string>
					  <key>purge_destination</key>
					  <true/>
				</dict>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					  <key>destination_path</key>
					  <string>%RECIPE_CACHE_DIR%/Applications/</string>
					  <key>pkg_payload_path</key>
					  <string>%RECIPE_CACHE_DIR%/unpack/com.microsoft.rdc.macos.pkg/Payload</string>
					  <key>purge_destination</key>
					  <true/>
				</dict>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
				<key>Arguments</key>
				<dict>
					 <key>faux_root</key>
					 <string>%RECIPE_CACHE_DIR%</string>
					 <key>version_comparison_key</key>
					 <string>CFBundleShortVersionString</string>
					 <key>installs_item_paths</key>
					 <array>
						  <string>/Applications/Microsoft Remote Desktop.app</string>
					 </array>
				</dict>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					 <key>pkg_path</key>
					 <string>%pathname%</string>
					 <key>repo_subdirectory</key>
					 <string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>com.github.keeleysam.recipes.GoogleTalkPlugin/MunkiPkginfoReceiptsEditor</string>
		  </dict>
		  <dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					 <key>path_list</key>
					 <array>
						  <string>%RECIPE_CACHE_DIR%/Applications/</string>
						  <string>%RECIPE_CACHE_DIR%/unpack/</string>
					 </array>
				</dict>
		  </dict>
	 </array>
</dict>
</plist>
