<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>"Downloads" Ouroboros 2, packages it for installation under After Effects CC 2019, and imports it into Munki.
	
NOTE:
- This recipe cannot determine the version of Ouroboros 2 and must have it fed in as Input, whether via override or via CLI with -k
- This recipe does not download the Ouroboros 2 zip archive--feed the zip archive into the recipe via -p

The sum of the two notes above would lead to an example run of this recipe as follows:

autopkg run Ouroboros2AfterEffectsCC2019.munki -p /path/to/ouroboros_2.0.3.zip -k VERSION=2.0.3</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.Ouroboros2AfterEffectsCC2019</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/sandervandijkandremcojanssen</string>
		<key>NAME</key>
		<string>Ouroboros2AfterEffectsCC2019</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-sandervandijkandremcojanssen-Ouroboros2AfterEffectsCC2019</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>With Ouroboros 2 you can create multiple strokes on one single path in After Effects.</string>
			<key>developer</key>
			<string>Sander van Dijk and Remco Janssen</string>
			<key>display_name</key>
			<string>Ouroboros 2 After Effects CC 2019</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>AfterEffectsCC2019</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.Ouroboros2AfterEffectsCC2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
