<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Voila disk image and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.voila</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Voila</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/globaldelighttechnologies</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-globaldelighttechnologies-Voila</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Screen recording or image capture, full screen or selective area - capture them all. With an intuitive interface and a powerful toolset, you get to effortlessly annotate images, export videos, organize files or simply share the way you want!</string>
			<key>developer</key>
			<string>Global Delight Technologies</string>
			<key>display_name</key>
			<string>Voila</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.voila</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
