<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Duik Bassel.2.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.DuikBassel2</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>RxLaboratory/DuAEF_Duik</string>
		<key>NAME</key>
		<string>DuikBassel2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Duik_Bassel.*\.zip</string>
				<key>curl_opts</key>
				<array>
					<string>-A "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.0 Safari/605.1.15"</string>
				</array>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>sort_by_highest_tag_names</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
