<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ray Dynamic Color 2.

CodeSignatureVerifier skipped 11/24/2020 due to the lack of anything with a usable code signature.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.RayDynamicColor2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RayDynamicColor2</string>
		<key>DOWNLOAD_URL</key>
		<string>https://aescripts.com/downloadable/download/sample/sample_id/450/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>RayDynamicColor2.zip</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
