<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ray Dynamic Texture and packages it for installation under After Effects CC 2019.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.RayDynamicTextureAfterEffectsCC2019</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RayDynamicTextureAfterEffectsCC2019</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.RayDynamicTexture</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects CC 2019</key>
					<string>0775</string>
					<key>Applications/Adobe After Effects CC 2019/Scripts</key>
					<string>0755</string>
					<key>Applications/Adobe After Effects CC 2019/Scripts/ScriptUI Panels</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;h4&gt;([\d\.]+)&amp;nbsp;&amp;nbsp;\(Current version\)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://aescripts.com/ray-dynamic-texture/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unarchive/Ray Dynamic Texture_v*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe After Effects CC 2019/Scripts/ScriptUI Panels/Ray Dynamic Texture.jsxbin</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%/Ray Dynamic Texture.jsxbin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Applications/Adobe After Effects CC 2019/Scripts</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0444</string>
							<key>path</key>
							<string>Applications/Adobe After Effects CC 2019/Scripts/ScriptUI Panels/Ray Dynamic Texture.jsxbin</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.georegulus.RayDynamicTextureAfterEffectsCC2019.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
