<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ray Dynamic Texture, packages it for After Effects CC 2020, and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.RayDynamicTextureAfterEffectsCC2020</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/sandervandijk</string>
		<key>NAME</key>
		<string>RayDynamicTextureAfterEffectsCC2020</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-sandervandijk-RayDynamicTextureAfterEffectsCC2020</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Ray Dynamic Texture is your solution to tedious texture work.</string>
			<key>developer</key>
			<string>Sander van Dijk</string>
			<key>display_name</key>
			<string>Ray Dynamic Texture After Effects CC 2020</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>AfterEffectsCC2020</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.RayDynamicTextureAfterEffectsCC2020</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
