<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest SlingPlayer Desktop disk image and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.SlingPlayerDesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/slingmedia</string>
		<key>NAME</key>
		<string>SlingPlayerDesktop</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-slingmedia-SlingPlayerDesktop</string>
			</array>
			<key>category</key>
			<string>Entertainment</string>
			<key>description</key>
			<string>Imagine having access to your favorite shows and channels – on any device, in any location. With Slingbox, you can watch live cable or satellite TV, video apps, recorded shows, and on demand shows on your phone, tablet, and computer.</string>
			<key>developer</key>
			<string>Sling Media</string>
			<key>display_name</key>
			<string>SlingPlayer Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.SlingPlayerDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
