<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest SlingPlayer Desktop application.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.SlingPlayerDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SlingPlayerDesktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.slingbox.com/Products/SlingplayerApps.aspx</string>
				<key>re_pattern</key>
				<string>&lt;a href="(\S*SlingplayerDesktop-[\d\.]*\.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
