<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest SlingPlayer Safari Plugin package.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.SlingPlayerSafariPlugin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SlingPlayerSafariPlugin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"falconplugintarget":{.*,"mac":{"minPluginVersion":"[\d\.]*","maxPluginVersion":"([\d\.]*)"</string>
				<key>result_output_var_name</key>
				<string>slingplayersafariversion</string>
				<key>url</key>
				<string>http://plugin.slingbox.com/installer_v2/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>http://autoupdate-origin.sling.com/plugin_binary/downloads/dmg/%slingplayersafariversion%/SlingPlayer_Plugin_%slingplayersafariversion%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Sling Media</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/SlingPlayer Plug-in Installer.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
