<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ColorNavigator installer and imports it into Munki.

Relying on a package recipe to extract the ColorNavigator package since it currently ships on a read-write disk image.

Note this recipe adds the version number to the "name" of the recipe since EIZO has dropped support for monitors when  releasing new major versions of ColorNavigator

Reference: http://www.eizoglobal.com/support/db/products/software/search?k=colornavigator</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.ColorNavigator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorNavigator</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/eizo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-eizo-ColorNavigator</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>The EIZO-developed ColorNavigator software makes calibration simple and produces predictable color results.</string>
			<key>developer</key>
			<string>EIZO</string>
			<key>display_name</key>
			<string>ColorNavigator</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.ColorNavigator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>name</key>
					<string>%NAME%%major_version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
