<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ColorNavigator installer and extracts the embedded package.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ColorNavigator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorNavigator</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ColorNavigator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.eizo.co.jp/update/ColorNavigator.xml</string>
				<key>re_pattern</key>
				<string>ColorNavigator.*\(Mac OS\)(?:(?:.|\n)*)&lt;softwareVersion&gt;([\.\d)]*)&lt;\/softwareVersion&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Copy the embedded package out of the disk image.</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/ColorNavigator 6.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/ColorNavigator-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>