<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ColorNavigator NX installer and extracts the embedded package.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ColorNavigatorNX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorNavigatorNX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ColorNavigatorNX</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/ColorNavigatorNX.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%/ColorNavigator*.pkg</string>
			</dict>
			<key>Comment</key>
			<string>Copy the embedded package out of the disk image.</string>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
