<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ColorNavigator installer and imports it into Munki.

Relying on a package recipe to extract the ColorNavigator package since it currently ships on a read-write disk image.

Note this recipe adds the version number to the "name" of the recipe since EIZO has dropped support for monitors when  releasing new major versions of ColorNavigator

Reference: http://www.eizoglobal.com/support/db/products/software/search?k=colornavigators

Requiring a logout since the GUI installer reopens ColorNavigator, but not from the CLI.  Also, updating calibration software while a user is using the monitor wouldn't be good.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.ColorNavigator</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/eizo</string>
		<key>NAME</key>
		<string>ColorNavigator</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireLogout</string>
			<key>catalogs</key>
			<array>
				<string>development-eizo-ColorNavigator</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>The EIZO-developed ColorNavigator software makes calibration simple and produces predictable color results.</string>
			<key>developer</key>
			<string>EIZO</string>
			<key>display_name</key>
			<string>ColorNavigator</string>
			<key>minimum_os_version</key>
			<string>10.6</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>uninstallable</key>
			<true/>
			<key>unattended_install</key>
			<false/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
			# Run the uninstaller script provided with the app.

			UNINSTALL_SCRIPT="/Library/Application Support/EIZO/ColorNavigator 6/ColorNavigator 6 Uninstaller.app/Contents/Resources/uninstall"

			[ -x "${UNINSTALL_SCRIPT}" ] || exit 1
			"${UNINSTALL_SCRIPT}"
			
			pkgutil --forget com.EIZO.pkg.ColorNavigator6</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.ColorNavigator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>name</key>
					<string>%NAME%%major_version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
