<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ColorNavigator 7 installer and modifies a postinstall to no longer open the ColorNavigator 7 window following installation. 

NOTES:
- This recipe depends on hjuutilainen's ChecksumVerifier.  Add this repo via:

autopkg repo-add hjuutilainen-recipes</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.ColorNavigator7</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorNavigator7</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.ColorNavigator7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>MD5</string>
				<key>checksum</key>
				<string>d5af1500ee9fc8f4a46fd85dafbd7250</string>
				<key>pathname</key>
				<string>%RECIPE_CACHE_DIR%/unpack/ColorNavigator_7.pkg/Scripts/postinstall</string>
			</dict>
			<key>Comment</key>
			<string>Verify MD5 matches ColorNavigator7.pkg postinstall script from ColorNavigator 7 7.0.8</string>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack/ColorNavigator_7.pkg/Scripts/postinstall</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>An edit of EIZO's postinstall, commenting out the line that opens the ColorNavigator 7 window following installation</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/sh
##Edit to disable opening the ColorNavigator 7 window following installation

#-------------------------------------------------------------------------------
# Defines
#-------------------------------------------------------------------------------

readonly PLUGS="./bin/plugs"
readonly SRC_PLUGINS_DIR="./plugins"
readonly KEXT_DIR="./kext"

readonly APP_DATA_DIR="/Library/Application Support/EIZO/ColorNavigator 7"
readonly INIT_SETTING_DIR="${APP_DATA_DIR}/_initialsetting"
readonly PLUGINS_DIR="${APP_DATA_DIR}/plugins"

readonly PKG_DIR=`dirname "${PACKAGE_PATH}"`
readonly INST_FLAG_DIR="${HOME}/.com.eizo.cn7.inst"

# Install plugins
readonly PLUGINS=(
	"com.eizo.cn7.libs"
	"com.eizo.cn7.sensorsdk"
	"com.eizo.framework.databasecontrol"
	"com.eizo.framework.monitorcontrol"
	"com.eizo.framework.sensorcontrol"
	"com.eizo.framework.flour"
	"com.eizo.framework.milk"
	"com.eizo.framework.oil"
	"com.eizo.framework.qualitycontrol"
	"com.eizo.cn7.data.value"
	"com.eizo.cn7.capability"
	"com.eizo.cn7.core"
	"com.eizo.cn7.help"
	"com.eizo.cn7.i18n.de"
	"com.eizo.cn7.i18n.en"
	"com.eizo.cn7.i18n.ja"
	"com.eizo.cn7.i18n.zh"
	"com.eizo.cn7.base"
	"com.eizo.cn7.data.model"
	"com.eizo.cn7.common"
	"com.eizo.cn7.calibration"
	"com.eizo.cn7.manualAdjustment"
	"com.eizo.cn7.rgbValidation"
	"com.eizo.cn7.ui"
	"com.eizo.cn7.ext.assetinformationmanagement"
	"com.eizo.cn7.ext.cmykValidation"
	"com.eizo.cn7.ext.cnnetwork"
	"com.eizo.cn7.ext.correlation"
	"com.eizo.cn7.ext.deviceMeasurement"
	"com.eizo.cn7.ext.iccProfileEmulation"
	"com.eizo.cn7.ext.lightbooth"
	"com.eizo.cn7.ext.logViewLutEmulation"
	"com.eizo.cn7.ext.monitorkeylocksetting"
	"com.eizo.cn7.ext.monitoroptionsetting"
	"com.eizo.cn7.ext.profadvsetting"
	"com.eizo.cn7.ext.syncAdjustmentInformation"
	"com.eizo.cn7.ext.targetCreationAssist"
	"com.eizo.cn7.ext.monitorConfigExportImport"
)

#-------------------------------------------------------------------------------
# Install plugins
#-------------------------------------------------------------------------------

umask 000
for pluginName in ${PLUGINS[@]}; do
	"${PLUGS}" "${PLUGINS_DIR}" install "${SRC_PLUGINS_DIR}/${pluginName}.zip"
	wait
done
umask 022

#-------------------------------------------------------------------------------
# Handle installer setting/selection
#-------------------------------------------------------------------------------

rm -rf "${INIT_SETTING_DIR}"
mkdir "${INIT_SETTING_DIR}"
chmod 777 "${INIT_SETTING_DIR}"

# Remove CN6
if [ -e "${INST_FLAG_DIR}/remove_cn6" ]; then
	killall "ColorNavigator 6"
	# terminate eacore and dummy
	for i in `ps aux -w | grep 'ColorNavigator 6.app' | grep -v grep | awk '{print $2}'`
	do
		kill $i
	done

	rm -rf "/Applications/ColorNavigator 6.app"
	wait
fi

# Remove CNNX
if [ -e "/Applications/ColorNavigator NX.app" ]; then
	killall "ColorNavigator NX"
	# terminate eacore and dummy
	for i in `ps aux -w | grep 'ColorNavigator NX.app' | grep -v grep | awk '{print $2}'`
	do
		kill $i
	done

	rm -rf "/Applications/ColorNavigator NX.app"
	wait
fi

# Remove CNNetAgent
if [ -e "/Applications/CNNetAgent.app" ]; then
	killall "CNNetAgent"
	rm -rf "/Applications/CNNetAgent.app"
	wait
fi

# Create initSetting files
if [ -e "${INST_FLAG_DIR}/checks_update" ]; then
	cat /dev/null &gt; "${INIT_SETTING_DIR}/checks_update"
fi

#-------------------------------------------------------------------------------
# Handle installer setting files
#-------------------------------------------------------------------------------

# Preferences
cp "${PKG_DIR}/preferences.json" "${INIT_SETTING_DIR}/"

# Language packs
for f in `find "${PKG_DIR}" -name "com.eizo.cn7.i18n.*.zip"`; do
	cp "$f" "${INIT_SETTING_DIR}/"
done

# Setup CNNetwork
./bin/set_net_mac.sh -src "${PKG_DIR}" -dst "${INIT_SETTING_DIR}"

#-------------------------------------------------------------------------------
# Copy basICColorDISCUS.kext
#-------------------------------------------------------------------------------
# check OS version is newer than 10.15
CATALINA_OR_LATER=$(sw_vers -productVersion \
    | awk -F. '{ print $1 "." $2 }' \
    | (read v ; echo "$v &gt;= 10.15"; ) \
    | bc)

if [ $(expr $CATALINA_OR_LATER) -eq 1 ]; then
    cp -rf "${KEXT_DIR}/basICColorDISCUS.kext" "/Library/Extensions"
else
    cp -rf "${KEXT_DIR}/basICColorDISCUS.kext" "/System/Library/Extensions"
fi

#-------------------------------------------------------------------------------
# Additional Setup
#-------------------------------------------------------------------------------

ln -sf /usr/local/lib/libftd2xx.1.2.2.dylib /usr/local/lib/libftd2xx.dylib

/sbin/kextload -b com.basICColor.driver.basICColorDISCUS

# db name is changed from v7.0.5. So if db has old name, it need to update.
if [ -d "${APP_DATA_DIR}/db" -a ! -d "${APP_DATA_DIR}/db.0" ]; then
	mv "${APP_DATA_DIR}/db" "${APP_DATA_DIR}/db.0"
elif [ ! -d "${APP_DATA_DIR}/db.0" ]; then
	mkdir  "${APP_DATA_DIR}/db.0"
fi

#-------------------------------------------------------------------------------
# Creanup
#-------------------------------------------------------------------------------

# Remove installer setting file
if [ -e "${INST_FLAG_DIR}" ]; then
	rm -rf "${INST_FLAG_DIR}"
fi

# For Permission error by Mac updating
chmod 777 /Library/Application\ Support/EIZO/ColorNavigator\ 7
chmod 777 /Library/Application\ Support/EIZO/ColorNavigator\ 7/db.0
chmod 777 /Library/Application\ Support/EIZO/db
chmod u+w ~/
chmod a+rx /usr/local/lib


# Launch Application
##Don't open the ColorNavigator window, it causes the installation to fail
##su ${USER} -c "open /Applications/ColorNavigator\ 7.app"
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/ColorNavigator_7.pkg/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload/root</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/ColorNavigator_7.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications/ColorNavigator 7.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/repack</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/ColorNavigator7-%version%.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
	</array>
</dict>
</plist>
