<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AccuBarcode Pro Special.</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.AccuBarcodeProSpecial</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AccuBarcodeProSpecial</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>AccuBarcodePro[\d\.]+macos\.dmg</string>
				<key>result_output_var_name</key>
				<string>discoveredfilename</string>
				<key>url</key>
				<string>http://www.accubarcode.com/special/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>AccuBarcodeProSpecial.dmg</string>
				<key>url</key>
				<string>http://www.accubarcode.com/sites/default/files/barcode/%discoveredfilename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
