<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AccuBarcode Pro Special and packages it for installation.

NOTE: The underlying installer that runs when the package is installed currently (6/1/2018,
version 3.0) requires the legacy Java 6 runtime.  Please ensure it is available.

NOTE: The AccuBarcode Pro Special installer drops a handful of fonts named "Accu*" in ~/Library/fonts
during installation.  Since I'm not sure about how this package will be used, please ensure
these fonts are placed somewhere they're available to users (e.g. /Library/Fonts).

NOTE: The AccuBarcode Pro Special installer creates a symlink to the AccuBarcode Pro Special application on
the Desktop.  Please ensure this symlink is addressed to your satisfaction.

NOTE: Leaving the package ID as "com.accubarcode.AccuBarcodePro.pkg" since in _theory_ this should
be a drop-in replacement for the non-special version of AccuBarcode Pro.</string>
	<key>Identifier</key>
	<string>com.github.foigus.pkg.AccuBarcodeProSpecial</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AccuBarcodeProSpecial</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.AccuBarcodeProSpecial</string>
	<key>Process</key>
	<array>
		<dict>
 			<key>Processor</key>
 			<string>DeprecationWarning</string>
 			<key>Arguments</key>
 			<dict>
 				<key>warning_message</key>
 				<string>This application does not work on macOS 10.15 or later.  This recipe will soon be removed.</string>
 			</dict>
 		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/AccuBarcode Pro Installer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/AccuBarcode Pro Installer.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/AccuBarcode Pro Installer.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

# Determine working directory
install_dir=`dirname $0`

# Install AccuBarcode Pro Special unattended-ly using the pkg from the resources directory
# Flag taken from here http://resources.ej-technologies.com/install4j/help/doc/index.html
"${install_dir}/AccuBarcode Pro Installer.app/Contents/MacOS/JavaApplicationStub" -q</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>com.accubarcode.AccuBarcodePro.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Scripts/AccuBarcode Pro Installer.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
