<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AccuBarcode Pro Special and imports it into Munki.

NOTE: The underlying installer that runs when the package is installed currently (6/1/2018,
version 2.50) requires the legacy Java 6 runtime.

NOTE: A logout is required since the AccuBarcode Pro Special installer bounces the Finder during
installation.

NOTE: This recipe has been tested under the assumption that the user will be logged out
during installation.  If the RestartAction of RequireLogout is removed, please be sure to
verify the postinstall_script that moves the AccuBarcode Pro Special fonts as well as the
AccuBarcode Pro Special installer's attempt to create a symlink to the application on the
current user's Desktop.

NOTE: Leaving the package ID as "com.accubarcode.AccuBarcodePro.pkg" since in _theory_ this should
be a drop-in replacement for the non-special version of AccuBarcode Pro.</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.AccuBarcodeProSpecial</string>
	<key>Input</key>
	<dict>
		<key>LEGACY_JAVA_6_PACKAGE_NAME</key>
		<string>Java6forOSX</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/rdcgroup</string>
		<key>NAME</key>
		<string>AccuBarcodeProSpecial</string>
		<key>pkginfo</key>
		<dict>
			<key>RestartAction</key>
			<string>RequireLogout</string>
			<key>catalogs</key>
			<array>
				<string>development-rdcgroup-AccuBarcodeProSpecial</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>AccuBarcode Pro Special helps graphic designers create quality barcodes in EPS and other formats.</string>
			<key>developer</key>
			<string>RDC Group</string>
			<key>display_name</key>
			<string>AccuBarcode Pro Special</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

#Remove any AccuBarcode Pro Special fonts from a previous installation (e.g. fonts that
#had been moved there by a previous installation of this AutoPkg recipe)
rm -f /Library/Fonts/Accu*

#Move the (assumedly new) AccuBarcode Pro Special fonts from where they're placed in root's
#Library/fonts to /Library/Fonts 
mv -f /var/root/Library/fonts/Accu* /Library/Fonts

#Remove the now-empty Library/fonts from root's home
rmdir /var/root/Library/fonts</string>
			<key>requires</key>
			<array>
				<string>%LEGACY_JAVA_6_PACKAGE_NAME%</string>
			</array>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash

#Delete the AccuBarcode Pro Special fonts
rm -f /Library/Fonts/Accu*

#Delete AccuBarcode Pro Special
rm -rf /Applications/AccuBarcode\ Pro

#Forget the package receipt
pkgutil --forget com.accubarcode.AccuBarcodePro.pkg</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.AccuBarcodeProSpecial</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
