<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Magic Bullet Suite and imports it into Munki.

NOTE:
- If a new plugin-eligible application is installed following the installation of this package, the plugins will not be available until this package is reinstalled</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.MagicBulletSuite</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>plugins/maxon</string>
		<key>NAME</key>
		<string>MagicBulletSuite</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-maxon-MagicBulletSuite</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Color correction, finishing and film looks.</string>
			<key>developer</key>
			<string>Maxon</string>
			<key>display_name</key>
			<string>Magic Bullet Suite</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.pkg.MagicBulletSuite</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
				<key>version</key>
				<string>%version%</string>
				<key>uninstall_script</key>
				<string>#!/bin/bash

version="%version%"
bundle_id="com.maxon.MagicBulletSuite.pkg"

/Users/Shared/Red\ Giant/uninstall/uninstall-com.redgiant.magicbullet_v"${version}".sh
pkgutil --forget "${bundle_id}"</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
