<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Redshift.

NOTE:
- If a new plugin-eligible application is installed following the installation of this package, the plugins will not be available until this package is reinstalled</string>
	<key>Identifier</key>
	<string>com.github.foigus.download.Redshift</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Redshift</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\/_nuxt\/static\/[\d]+\/en\/downloads\/payload\.js</string>
				<key>result_output_var_name</key>
				<string>url_stub</string>
				<key>url</key>
				<string>https://www.maxon.net/en/downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https:\\u002F\\u002Finstaller\.maxon\.net\\u002Finstaller\\u002Frs\\u002Fredshift_v[^\s,]+_macos_metal\.pkg</string>
				<key>result_output_var_name</key>
				<string>encoded_download_url</string>
				<key>url</key>
				<string>https://www.maxon.net%url_stub%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>\u002F</string>
				<key>input_string</key>
				<string>%encoded_download_url%</string>
				<key>replace</key>
				<string>/</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Redshift Rendering Technologies, Inc. (588NFGZ664)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
