<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest PXPlay package and imports it into Munki.

- Valid values for the "ARCH" Input variable are "arm64" (Apple Silicon) and "amd64" (Intel).
- Valid values for the "MUNKI_SUPPORTED_ARCH" Input variable are "arm64" (Apple Silicon) and "x86_64" (Intel).</string>
	<key>Identifier</key>
	<string>com.github.foigus.munki.PXPlay</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/streamingdv</string>
		<key>MUNKI_SUPPORTED_ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>PXPlay</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-streamingdv-PXPlay</string>
			</array>
			<key>category</key>
			<string>Entertainment</string>
			<key>description</key>
			<string>PXPlay allows you to remotely control your PlayStation console without limitations.</string>
			<key>developer</key>
			<string>Streamingdv</string>
			<key>display_name</key>
			<string>PXPlay</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.download.PXPlay</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>supported_architectures</key>
					<array>
						<string>%MUNKI_SUPPORTED_ARCH%</string>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
